{
  "<s>": 0,
  "</s>": 2,
  "<pad>": 1,
  "<unk>": 3,
  "<mask>": 4,
  "cccc([N+](=O)[O-])": 5,
  "ccc([N+](=O)[O-])": 6,
  "([N+](=O)[O-])cc": 7,
  "cc([N+](=O)[O-])": 8,
  "CH][CH][CH][CH][": 9,
  ")[C@H](CCCNC(=N": 10,
  ")[C@H](CCCCN)NC": 11,
  "[CH][CH][CH][CH": 12,
  "C@@H](CCCNC(=N)": 13,
  "c([N+](=O)[O-])": 14,
  "](CCCNC(=N)N)NC": 15,
  "N[C@@H](CCCNC(=": 16,
  "[C@@H](CCCNC(=N": 17,
  "O)[C@H](CCCNC(=": 18,
  "@@H](CCCNC(=N)N": 19,
  "([N+](=O)[O-])c": 20,
  "COc1ccc(-c2coc3": 21,
  "(=O)[C@H](CCCNC": 22,
  "[C@@H](Cc1ccccc": 23,
  "1ccc([N+](=O)[O": 24,
  "(=O)[C@H](CCCCN": 25,
  "N+](=O)[O-])cc1": 26,
  "H](CCCNC(=N)N)": 27,
  "c[nH]c2ccccc12": 28,
  "N+](=O)[O-])cc": 29,
  ")N[C@@H](CCCNC": 30,
  "c[nH]c3ccccc23": 31,
  "CH][CH][CH][CH": 32,
  ")N[C@@H](CCCCN": 33,
  "@H](CCCNC(=N)N": 34,
  "([N+](=O)[O-])": 35,
  "COc1ccc(NC(=O)": 36,
  "][CH][CH][CH][": 37,
  "ccc([N+](=O)[O": 38,
  "N[C@@H](CCCCN)": 39,
  "O=[N+]([O-])c1": 40,
  "C@H](CCCNC(=N)": 41,
  "CH][CH][CH][C]": 42,
  "COc1ccc(-c2ccc": 43,
  "[nH]c2ccccc12)": 44,
  "](CO)[C@@H](O": 45,
  "COc1ccc(-c2cc": 46,
  "ccc(S(=O)(=O)": 47,
  "C@@H](NC(=O)[": 48,
  "=[N+]([O-])c1": 49,
  "H](CO)[C@@H](": 50,
  "NC(=O)[C@@H](": 51,
  "COc1ccc(C(=O)": 52,
  "H](CCCNC(=N)N": 53,
  "N[C@@H](CCCNC": 54,
  "(=O)[C@@H](NC": 55,
  "1ccc(S(=O)(=O": 56,
  "O)[C@@H](NC(=": 57,
  "[CH][CH][CH][": 58,
  "COc1ccc2[nH]c": 59,
  "COc1ccc(/C=C/": 60,
  "CH][CH][CH][C": 61,
  "[nH]c2ccccc12": 62,
  ")[C@@H](NC(=O": 63,
  "CO)[C@@H](O)[": 64,
  "1c[nH]c2ccccc": 65,
  "N+](=O)[O-])c": 66,
  "@@H](NC(=O)[C": 67,
  "](CCCNC(=N)N)": 68,
  "ccc([N+](=O)[": 69,
  "COc1ccc(-c2nc": 70,
  "COc1cc(C(=O)": 71,
  "(=O)[C@H](Cc": 72,
  "COc1ccc2[nH]": 73,
  "N+](=O)[O-])": 74,
  "COc1ccc(/C=C": 75,
  "CH][CH][CH][": 76,
  "COc1ccc(OC)c": 77,
  "NC(=O)[C@H](": 78,
  "COC(=O)[C@@H": 79,
  "COC(=O)c1ccc": 80,
  "CC(=O)Nc1ccc": 81,
  "COc1cc(/C=C/": 82,
  "ccc(S(=O)(=O": 83,
  "H](O)[C@@H](": 84,
  ")[C@@H](O)[C": 85,
  "(=O)[C@H](CC": 86,
  "COc1cccc(-c2": 87,
  "@H](CO)[C@@H": 88,
  "@H](NC(=O)[C": 89,
  "CCCCCCCCCCCC": 90,
  "][CH][CH][CH": 91,
  "H](NC(=O)[C@": 92,
  "COc1cc2c(cc1": 93,
  ")NC(=O)[C@@H": 94,
  "CCOC(=O)c1cc": 95,
  "CC(=O)OC1CC2": 96,
  "C@H](CO)[C@@": 97,
  "Cc1ccc(C(=O)": 98,
  "COc1ccc2c(c1": 99,
  "@@H](O)[C@@H": 100,
  "NC(=O)[C@@H]": 101,
  ".[Br-].[Br-]": 102,
  "C@H](NC(=O)[": 103,
  ")[C@@H](NC(=": 104,
  "1ccc(S(=O)(=": 105,
  "](NC(=O)[C@H": 106,
  "H](O)[C@H](": 107,
  "](NC(=O)[C@": 108,
  "[C@H](NC(=O": 109,
  "[CH][CH][CH": 110,
  ")NC(=O)[C@@": 111,
  "C@H](O)[C@@": 112,
  "@H](O)[C@@H": 113,
  "COc1ccc(-c2": 114,
  "ccc(C(F)(F)": 115,
  "O=C(Nc1ccc(": 116,
  ")N[C@@H](CC": 117,
  ")[C@H](O)[C": 118,
  "@H](NC(=O)[": 119,
  ")N[C@@H](Cc": 120,
  "COC(=O)c1cc": 121,
  "NC(=O)[C@@H": 122,
  "C@@H](O)[C@": 123,
  "O)[C@H](Cc1": 124,
  "(=O)[C@@H](": 125,
  "COc1ccc(-n2": 126,
  "([N+](=O)[O": 127,
  "O)[C@H](O)[": 128,
  ")NC(=O)[C@H": 129,
  "COc1ccc(/C=": 130,
  "+](=O)[O-])": 131,
  "H](NC(=O)[C": 132,
  "Cc1cc(C(=O)": 133,
  "COC(=O)[C@H": 134,
  "[C@H](CO)[C": 135,
  "](O)[C@H](O": 136,
  "COc1cc(/C=C": 137,
  "H](Cc1c[nH]": 138,
  "CCS(=O)(=O)": 139,
  "(S(=O)(=O)N": 140,
  "C[C@]12CC[C": 141,
  "COc1cc(OC)c": 142,
  "O=C(Nc1cccc": 143,
  "CCOC(=O)c1c": 144,
  "H](O)[C@@H]": 145,
  "N[C@@H](CC(": 146,
  "O[C@H](CO)[": 147,
  "C@@H](NC(=O": 148,
  "O)[C@H](CC(": 149,
  ")[C@@H](O)[": 150,
  "CC(=O)OC1CC": 151,
  "COc1ccccc1C": 152,
  "@@H](O)[C@H": 153,
  "C=CC(=O)Nc1": 154,
  "N[C@@H](Cc1": 155,
  "O=C(COc1ccc": 156,
  "(=O)N[C@@H": 157,
  "COc1cc(/C=": 158,
  "CC(C)(C)c1": 159,
  "Na+].[Na+]": 160,
  "(=O)[C@H](": 161,
  "C@H](C(=O)": 162,
  "Cc1c[nH]c2": 163,
  "a+].[Na+].": 164,
  "H](NC(=O)[": 165,
  "](O)[C@H](": 166,
  "O=S(=O)(c1": 167,
  "C[C@@H]1CN": 168,
  "COc1cc2c(c": 169,
  "COc1cc(OC)": 170,
  "[C@H](C(=O": 171,
  "([N+](=O)[": 172,
  "CS(=O)(=O)": 173,
  "@@H](O)[C@": 174,
  "H](O)[C@@H": 175,
  ")[C@H](Cc1": 176,
  "O)N[C@@H](": 177,
  "NC(=O)[C@H": 178,
  "C(=O)N[C@@": 179,
  "C@H](NC(=O": 180,
  "O=C(Nc1ccc": 181,
  "S(=O)(=O)c": 182,
  "COc1ccc2nc": 183,
  "CC(C)[C@@H": 184,
  "COc1ccc(C=": 185,
  "C@@H](O)[C": 186,
  "COc1ccccc1": 187,
  "+].[Na+].[": 188,
  ")NC(=O)[C@": 189,
  "CCOC(=O)[C": 190,
  "COc1ccc(CC": 191,
  "(=O)[C@@H]": 192,
  "COc1ccc(C2": 193,
  "(F)(F)F)cc": 194,
  "COc1cc(O)c": 195,
  "C@H](O)[C@": 196,
  "CC(=O)c1c(": 197,
  "COc1cccc(-": 198,
  "CH][CH][CH": 199,
  "N[C@H](C(=": 200,
  "(S(=O)(=O)": 201,
  "CN(C)c1ccc": 202,
  "H](O)[C@H]": 203,
  "COc1ccc([C": 204,
  "CC(C)=CCc1": 205,
  "CCOC(=O)C1": 206,
  "Cc1ccc(-c2": 207,
  ")[C@H](O)[": 208,
  "O=c1cc(-c2": 209,
  "Nc1ncnc2c1": 210,
  "COc1cccc(C": 211,
  "COc1cc(-c2": 212,
  "NC(=O)[C@@": 213,
  "CC(=O)OCC1": 214,
  "COc1ccc(CN": 215,
  "COc1ccc(N2": 216,
  "CCOC(=O)c1": 217,
  "S(=O)(=O)N": 218,
  "O=C(c1ccc(": 219,
  "OC(CO)C(O)": 220,
  "[C@H](NC(=": 221,
  "CC(=O)OC1C": 222,
  "CC(C)c1ccc": 223,
  "@H](O)[C@H": 224,
  "O)[C@H](Cc": 225,
  "FC(F)(F)c1": 226,
  "O)[C@H](CC": 227,
  "N[C@@H](CC": 228,
  "[C@@H](Cc1": 229,
  "COc1ccc(-": 230,
  "CC(=O)Oc1": 231,
  "(S(=O)(=O": 232,
  "O)[C@@H]1": 233,
  "Cc1cccc(C": 234,
  "COC(=O)CC": 235,
  "Cc1cc(=O)": 236,
  "O)N[C@H](": 237,
  "CCOc1ccc(": 238,
  "N+](=O)[O": 239,
  "(F)(F)F)c": 240,
  "N#Cc1cccc": 241,
  "[C@@H](Cc": 242,
  "COc1cccc2": 243,
  "COC(=O)C(": 244,
  "(=O)N[C@H": 245,
  ")NC(=O)[C": 246,
  "COC(=O)[C": 247,
  "O=C(c1ccc": 248,
  "COc1ccc(N": 249,
  ")[C@H](Cc": 250,
  ")C(=O)N[C": 251,
  "CC(C)(C)C": 252,
  "CNC(=O)c1": 253,
  ")C(F)(F)F": 254,
  "@@H](O)[C": 255,
  "CC(C)[C@H": 256,
  "Cc1ccccc1": 257,
  "CC(=O)N[C": 258,
  ")N[C@@H](": 259,
  "C@H](NC(=": 260,
  "@H](NC(=O": 261,
  "CC1(C)CCC": 262,
  "C=C1C(=O)": 263,
  ")[C@@H](O": 264,
  "ccc(Cl)cc": 265,
  "COC(=O)C1": 266,
  "COC(=O)c1": 267,
  "CC(=O)OC1": 268,
  "COc1ccc(C": 269,
  "H](O)[C@H": 270,
  "COc1cc(C2": 271,
  "S(=O)(=O)": 272,
  "Cc1cc(C)c": 273,
  "CCOC(=O)C": 274,
  "COc1cccc(": 275,
  "Cc1cc(O)c": 276,
  "O)[C@@H](": 277,
  "F)(F)F)cc": 278,
  "C@H](O)[C": 279,
  "COc1cc(O)": 280,
  "(=O)[C@@H": 281,
  "C(=O)N[C@": 282,
  "CC(=O)OCC": 283,
  "(=O)N[C@@": 284,
  "(C(F)(F)F": 285,
  "[Na+].[Na": 286,
  "CC(=O)Nc1": 287,
  "C(F)(F)F)": 288,
  "a+].[Na+]": 289,
  "@H](O)[C@": 290,
  "](O)[C@H]": 291,
  "(=O)(=O)c": 292,
  "O=c1[nH]c": 293,
  "COc1cc2c(": 294,
  "COc1ccc2c": 295,
  "C@@H](O)[": 296,
  "+].[Na+].": 297,
  ".[Na+].[N": 298,
  ")N[C@H](C": 299,
  "CC(=O)O[C": 300,
  "O=C(COc1": 301,
  "S(=O)(=O": 302,
  "(=O)(=O)": 303,
  "O=C1NC(=": 304,
  "C=C(C)C1": 305,
  "C[C@@H](": 306,
  ")N[C@H](": 307,
  "[Na+].[N": 308,
  "O=C(O)c1": 309,
  "Cc1cc(O)": 310,
  "CC(=O)NC": 311,
  "CC(=O)N1": 312,
  "Cc1cc2c(": 313,
  "[C@@H](C": 314,
  "(=O)N[C@": 315,
  "COC(=O)N": 316,
  ")[C@@H](": 317,
  "COc1cc(C": 318,
  "CCOC(=O)": 319,
  "O=C(NCc1": 320,
  "CCCC(=O)": 321,
  "CCOc1ccc": 322,
  ")C(=O)N[": 323,
  "O=C(CCc1": 324,
  "O=C(O)CC": 325,
  "O=C(O)[C": 326,
  "N#Cc1ccc": 327,
  "CN1C(=O)": 328,
  "COC(=O)C": 329,
  "CCc1ccc(": 330,
  "COc1cccc": 331,
  ".[Na+].[": 332,
  "(C(F)(F)": 333,
  "O=C(CSc1": 334,
  "Cc1ccc(C": 335,
  "Cc1cccc(": 336,
  "Cc1cc(C)": 337,
  "(O)C(O)C": 338,
  "Cc1ccc(N": 339,
  "(S(=O)(=": 340,
  "Na+].[Na": 341,
  "CC(=O)c1": 342,
  "COc1ccc(": 343,
  "C=CC(=O)": 344,
  "C=C1C(=O": 345,
  "CCNC(=O)": 346,
  "CCC(=O)N": 347,
  "COc1c2c(": 348,
  "CC1CCC2(": 349,
  "C(=O)N[C": 350,
  "(=O)[C@H": 351,
  "O)N[C@@H": 352,
  "C@H](O)[": 353,
  ")[C@@H]1": 354,
  "O=C(c1cc": 355,
  "@H](O)[C": 356,
  "CCCCCCCC": 357,
  "COc1ccc2": 358,
  "CC(C)(C)": 359,
  "C(F)(F)F": 360,
  "NC(=O)c1": 361,
  "F)(F)F)c": 362,
  "CC(=O)OC": 363,
  ")[C@H](O": 364,
  "O)[C@H](": 365,
  "(F)(F)F)": 366,
  "CC(C)C[C": 367,
  "Cc1ccc(-": 368,
  ")NC(=O)[": 369,
  "O=S(=O)(": 370,
  "C[C@@H]1": 371,
  "O)[C@@H]": 372,
  "](O)[C@H": 373,
  "COc1c(O)": 374,
  "H](O)[C@": 375,
  "CC1(C)CC": 376,
  "CC1(C)[C": 377,
  "(NC(=O)": 378,
  "CC[C@@H": 379,
  "S(=O)(=": 380,
  "C[C@H](": 381,
  "CCCc1cc": 382,
  "CCN(CC)": 383,
  "C@@H](C": 384,
  "a+].[Na": 385,
  "CCC(=O)": 386,
  "CC(=O)N": 387,
  "[C@@H](": 388,
  "(=O)N[C": 389,
  "Clc1ccc": 390,
  "CC(C)CN": 391,
  "CCCCCCC": 392,
  "CC1CCC2": 393,
  "Cc1cc(N": 394,
  "Cc1nc(N": 395,
  "CCNC(=O": 396,
  "CC(C)c1": 397,
  "O)N[C@@": 398,
  "C(F)(F)": 399,
  "C=C1CCC": 400,
  "CN1C(=O": 401,
  "2ccccc2": 402,
  "CC(C)CC": 403,
  "O=C1Nc2": 404,
  "O=C(NC1": 405,
  "C[C@H]1": 406,
  "[C@H](C": 407,
  "(F)(F)F": 408,
  ")[C@H](": 409,
  ")N[C@@H": 410,
  "F)(F)F)": 411,
  "CCOc1cc": 412,
  "Cc1ccc2": 413,
  "CCC(C)C": 414,
  "C(=O)N[": 415,
  "CC1=C(C": 416,
  "Cc1cccc": 417,
  "COc1cc2": 418,
  "Cc1cc(C": 419,
  "COC(=O)": 420,
  "(=O)(=O": 421,
  "O=C(NCC": 422,
  "O=C(Cc1": 423,
  ")C(=O)N": 424,
  "C=C(C)C": 425,
  "O)C(O)C": 426,
  "O=C(Nc1": 427,
  "CN1CCN(": 428,
  "O=C(N[C": 429,
  "Cc1ccc(": 430,
  "C[C@]12": 431,
  "CN(C)c1": 432,
  ")[C@@H]": 433,
  "(C(F)(F": 434,
  "CCc1ccc": 435,
  "(=O)[C@": 436,
  "O)[C@@H": 437,
  "H](O)[C": 438,
  "CC1(C)C": 439,
  "O=C(CN1": 440,
  "COc1cc(": 441,
  "N[C@H](": 442,
  "COc1ccc": 443,
  "O=C1C(=": 444,
  "CC12CCC": 445,
  "O=C(O)C": 446,
  "[C@@H]2": 447,
  "CCOC(=O": 448,
  "CNC(=O)": 449,
  "O)N[C@H": 450,
  "O)[C@H]": 451,
  "1ccccc1": 452,
  "[C@@H]1": 453,
  "CC(C)[C": 454,
  "CC(C)C(": 455,
  "COc1c(": 456,
  ")C(=O)": 457,
  "CC(C)N": 458,
  "O)(=O)": 459,
  "CC1CCC": 460,
  "F)(F)F": 461,
  "[C@H]2": 462,
  "C=C(C)": 463,
  "[C@@H]": 464,
  "CC(C)C": 465,
  "CCc1nc": 466,
  "CC(C)=": 467,
  "O)[C@H": 468,
  "CCCCCC": 469,
  "CNC(=O": 470,
  "C@H](C": 471,
  "CCCCc1": 472,
  "Cc1nc2": 473,
  "Cc1nnc": 474,
  "CCc1cc": 475,
  "c1ccc(": 476,
  "COC(=O": 477,
  "O=C1C=": 478,
  "CC1OC(": 479,
  "Fc1ccc": 480,
  "(=O)c1": 481,
  "C@@H]2": 482,
  "C@H](O": 483,
  "C[C@@H": 484,
  "NC(=O)": 485,
  "CCCCN(": 486,
  "C=CCc1": 487,
  "Cc1oc2": 488,
  "O)[C@@": 489,
  "C=C1CC": 490,
  "CC[C@H": 491,
  ")N[C@@": 492,
  ")[C@H]": 493,
  "CC(C)(": 494,
  "(C)(C)": 495,
  "O=C(O)": 496,
  "(=O)[C": 497,
  "Cc1cc(": 498,
  "C[C@@]": 499,
  "N=C(N)": 500,
  "Cc1cc2": 501,
  "N#Cc1c": 502,
  "C@@H]1": 503,
  "(F)(F)": 504,
  "O=C1c2": 505,
  ")[C@@H": 506,
  "(C(=O)": 507,
  "CN(Cc1": 508,
  "C(=O)N": 509,
  "CCCC[C": 510,
  "O=c1cc": 511,
  "Cc1nc(": 512,
  "O=C(NC": 513,
  "CC(=O)": 514,
  "CN(C)C": 515,
  ")C(O)C": 516,
  ")(F)F)": 517,
  "C(F)(F": 518,
  "O=C(c1": 519,
  "[C@H](": 520,
  "C@@H](": 521,
  "Nc1ccc": 522,
  "COc1cc": 523,
  "O=C(CC": 524,
  "CC1(C)": 525,
  ")NC(=O": 526,
  "Cc1ccc": 527,
  "O=c1c2": 528,
  "CC1=CC": 529,
  "O=C1NC": 530,
  "Oc1ccc": 531,
  "[C@H]1": 532,
  "(=O)N[": 533,
  "Cc1c(C": 534,
  "O=C1CC": 535,
  "O=C(O": 536,
  "N[C@H": 537,
  "c1ccc": 538,
  "CCN(C": 539,
  "CC(O)": 540,
  ")(F)F": 541,
  "@@H]1": 542,
  "COCCN": 543,
  "O=C(C": 544,
  "CCCc1": 545,
  "CC1CC": 546,
  "Cn1nc": 547,
  "CN1CC": 548,
  "Cc1oc": 549,
  "(=O)N": 550,
  "O=C(N": 551,
  "@@H](": 552,
  "Cc1cn": 553,
  "C@@H]": 554,
  "C=C1C": 555,
  "O=c1c": 556,
  "CCn1c": 557,
  "COC1=": 558,
  "[C@@H": 559,
  ")[C@H": 560,
  "[C@H]": 561,
  "CC1(C": 562,
  "Cc1cc": 563,
  "CCC[C": 564,
  "Cc1c(": 565,
  "CCC(C": 566,
  "C(=O)": 567,
  "C[C@H": 568,
  "C@H](": 569,
  "(C(=O": 570,
  "F)(F)": 571,
  ")[C@@": 572,
  "[nH]c": 573,
  "C/C(=": 574,
  "C[C@]": 575,
  "C(O)C": 576,
  "C=CC1": 577,
  "CN(C)": 578,
  "Cc1nn": 579,
  "CCCN(": 580,
  "N#Cc1": 581,
  "CC1=C": 582,
  "ccccc": 583,
  "(=O)c": 584,
  "COc1c": 585,
  ")C(=O": 586,
  "Cn1cc": 587,
  "C=C[C": 588,
  "Cc1nc": 589,
  "CC(C)": 590,
  "CCOc1": 591,
  "CCCCC": 592,
  "O)[C@": 593,
  "C@H]1": 594,
  "1ccc(": 595,
  "(=O)O": 596,
  "(=O)C": 597,
  "Nc1nc": 598,
  "C=C(C": 599,
  "CCCCN": 600,
  "C/C=C": 601,
  "(F)(F": 602,
  "(=O)[": 603,
  "O)N[C": 604,
  "C@H]2": 605,
  "COC[C": 606,
  "O=C([": 607,
  "C=CCN": 608,
  "CCC1(": 609,
  ")C(O)": 610,
  "N#CC1": 611,
  "O=C1C": 612,
  "COC1C": 613,
  "COCC": 614,
  "COC1": 615,
  "O=C1": 616,
  "COc1": 617,
  "CC(C": 618,
  "(Cl)": 619,
  "CCC(": 620,
  "CN(C": 621,
  "F)(F": 622,
  "[nH]": 623,
  ")cc1": 624,
  "OC[C": 625,
  "O)[C": 626,
  "@H]1": 627,
  "O)C(": 628,
  "CN1C": 629,
  "(C)C": 630,
  ")[C@": 631,
  "1ccc": 632,
  "C=CC": 633,
  "C=C1": 634,
  "CSc1": 635,
  "@@H]": 636,
  "CO[C": 637,
  "CC1=": 638,
  "CCCC": 639,
  "(O)C": 640,
  "O)c1": 641,
  "CCn1": 642,
  "[C@@": 643,
  "ccc(": 644,
  "CCN1": 645,
  "CC/C": 646,
  "O=C(": 647,
  "C@H]": 648,
  "O)N[": 649,
  "Cn1c": 650,
  "CCc1": 651,
  "CCC1": 652,
  "CC12": 653,
  "CN[C": 654,
  "CC1C": 655,
  "CC=C": 656,
  "C=C(": 657,
  "CCCN": 658,
  "Cc1c": 659,
  "CC1(": 660,
  "C(=O": 661,
  "[C@H": 662,
  "C@@H": 663,
  "@H](": 664,
  "CNc1": 665,
  "CNCC": 666,
  "O=c1": 667,
  "Clc1": 668,
  "N#CC": 669,
  "(=O)": 670,
  ")N[C": 671,
  "C(O)": 672,
  "CC(O": 673,
  ")C(=": 674,
  "CC[C": 675,
  "CCN(": 676,
  "c1cc": 677,
  "(C(=": 678,
  "nH]c": 679,
  "(-c2": 680,
  "N[C": 681,
  "O=C": 682,
  "cc(": 683,
  "CCN": 684,
  ")[C": 685,
  "O)N": 686,
  ")c2": 687,
  "=C(": 688,
  "O)[": 689,
  "(-c": 690,
  ")CC": 691,
  "(O)": 692,
  "[C@": 693,
  "C@@": 694,
  "@H]": 695,
  "H]1": 696,
  ")C(": 697,
  "cc1": 698,
  "C)C": 699,
  "C/C": 700,
  "O=S": 701,
  "Cc1": 702,
  "CCC": 703,
  "CC=": 704,
  "NC(": 705,
  "CNC": 706,
  "C[C": 707,
  "C@H": 708,
  "nH]": 709,
  "C(C": 710,
  "(=O": 711,
  "N#C": 712,
  "CO/": 713,
  ")c(": 714,
  "ccc": 715,
  "@@H": 716,
  "H](": 717,
  ")cc": 718,
  "O)c": 719,
  "(C)": 720,
  ")c1": 721,
  "O)C": 722,
  "COC": 723,
  "CC(": 724,
  "O[C": 725,
  "C=C": 726,
  "CN(": 727,
  "Cl.": 728,
  "Fc1": 729,
  "CC1": 730,
  "Nc1": 731,
  "CCO": 732,
  "Cn1": 733,
  "Oc1": 734,
  "CN1": 735,
  "C[N": 736,
  "C@": 737,
  "H]": 738,
  ")[": 739,
  "OC": 740,
  "CC": 741,
  "C[": 742,
  "O=": 743,
  "CO": 744,
  "NC": 745,
  "3)": 746,
  "=C": 747,
  "@@": 748,
  "F)": 749,
  "c3": 750,
  ")N": 751,
  "](": 752,
  "(O": 753,
  "c(": 754,
  "c1": 755,
  "N#": 756,
  "CN": 757,
  "C=": 758,
  "2)": 759,
  "[C": 760,
  ")C": 761,
  "(C": 762,
  "(=": 763,
  "@H": 764,
  "c2": 765,
  "C(": 766,
  "cc": 767,
  "C)": 768,
  ")c": 769,
  "O)": 770,
  "C#": 771,
  "2c": 772,
  "@": 773,
  "]": 774,
  "4": 775,
  "F": 776,
  "H": 777,
  "=": 778,
  "2": 779,
  "1": 780,
  "(": 781,
  "3": 782,
  ")": 783,
  "N": 784,
  "[": 785,
  "C": 786,
  "NCc": 787,
  "CCl": 788,
  "\u011a": 789,
  "\u0115": 790,
  "SCCSc": 791,
  "m": 792,
  "OCCBr": 793,
  "CBr": 794,
  "v": 795,
  "\u011c": 796,
  "c": 797,
  "\u00a6": 798,
  ")(=": 799,
  "SCCC": 800,
  "!": 801,
  "-])/": 802,
  "\u00ac": 803,
  "\u00db": 804,
  "FCCC": 805,
  "\u00cb": 806,
  "@](=": 807,
  "42": 808,
  "CCOCCN": 809,
  "CCCSCC": 810,
  "\u011d": 811,
  "\u00e6": 812,
  "f": 813,
  "\u00be": 814,
  "%": 815,
  "\u012b": 816,
  "SCCS": 817,
  "CCCCNC": 818,
  "<": 819,
  "OCC": 820,
  "\u012f": 821,
  "\u00d6": 822,
  "SCC": 823,
  "SCN": 824,
  "ns": 825,
  "OCCSc": 826,
  "(/": 827,
  "\u00e0": 828,
  "\u00a4": 829,
  "ONC": 830,
  "CNCCN": 831,
  "\u0102": 832,
  "nnsc": 833,
  "COCCCCC": 834,
  "ccon": 835,
  ",": 836,
  "CNc": 837,
  "NCCCN": 838,
  "CSCCCC": 839,
  "T": 840,
  "\u00fa": 841,
  "COCCCn": 842,
  "w": 843,
  "CNCCC": 844,
  "cccnn": 845,
  "cnnc": 846,
  "\u010f": 847,
  "NCCNS": 848,
  "CCOc": 849,
  "NOc": 850,
  "\u00f1": 851,
  "Q": 852,
  "+": 853,
  "CCCCSc": 854,
  "CCCO": 855,
  "o": 856,
  "\u012d": 857,
  "35": 858,
  "(#": 859,
  "M": 860,
  "Clc": 861,
  "NCCn": 862,
  "\u0111": 863,
  "X": 864,
  "\u0107": 865,
  "\u013a": 866,
  "\u0113": 867,
  "\u0120": 868,
  "CCOCCCn": 869,
  "OCCCc": 870,
  "CON": 871,
  "\u00f4": 872,
  "nccc": 873,
  "\u012e": 874,
  "\u0117": 875,
  "NCCSC": 876,
  "Fc": 877,
  "\u0138": 878,
  "CCSCCOc": 879,
  "OCCCNc": 880,
  "\u0100": 881,
  "\u0140": 882,
  "COCOc": 883,
  "CCCCOc": 884,
  "\u00c7": 885,
  "CCCCn": 886,
  "CCOC": 887,
  "NCCNc": 888,
  "cncnc": 889,
  "CCCCOCc": 890,
  "\u00d9": 891,
  "-])=": 892,
  "\"": 893,
  "cncc": 894,
  "CH": 895,
  "COCCCNc": 896,
  "OCN": 897,
  "43": 898,
  "\u0135": 899,
  "Z": 900,
  ")-": 901,
  "-])(": 902,
  "\u00ab": 903,
  "CCOCCCc": 904,
  "CCCCCCN": 905,
  "NOCC": 906,
  "OCCOCCS": 907,
  "OCCCS": 908,
  "COCCCNC": 909,
  "\u00b3": 910,
  "NOCCc": 911,
  "u": 912,
  "b": 913,
  "cnsn": 914,
  "ncon": 915,
  "CSCCCN": 916,
  "\u0116": 917,
  "OCCCSc": 918,
  "\u00d2": 919,
  "k": 920,
  "COCCCC": 921,
  "@@]": 922,
  "([": 923,
  "CCCOC": 924,
  "CCCCNS": 925,
  "ncsc": 926,
  "ccno": 927,
  "@]([": 928,
  "p": 929,
  "SCCn": 930,
  "CCOCCOc": 931,
  "NCCC": 932,
  "\u0130": 933,
  "ocnc": 934,
  "CCCOCC": 935,
  "\u0143": 936,
  "ccnc": 937,
  "OCCc": 938,
  "\u00ba": 939,
  "\u0124": 940,
  "\u00d4": 941,
  "COc": 942,
  "CCOCCNC": 943,
  "NCN": 944,
  "j": 945,
  "\u00c1": 946,
  "NNc": 947,
  "OCCCCC": 948,
  "snc": 949,
  "NCCCCn": 950,
  "cnsc": 951,
  "z": 952,
  "nccn": 953,
  "SCCCC": 954,
  "OCCCCN": 955,
  "\u0119": 956,
  "Ic": 957,
  "\u00f8": 958,
  "\u0109": 959,
  "\u00bc": 960,
  "cccc": 961,
  "t": 962,
  "COCCc": 963,
  "Br": 964,
  "CCOCCCNc": 965,
  "`": 966,
  "-])[": 967,
  "nsc": 968,
  "CSCCSC": 969,
  "13": 970,
  "q": 971,
  "\u00aa": 972,
  "nnnn": 973,
  "NCCOCC": 974,
  "OCCN": 975,
  "CCCCl": 976,
  "OCCO": 977,
  "CCCCNc": 978,
  "\u00b7": 979,
  "CSCCOC": 980,
  "CCOCCOCc": 981,
  "ccco": 982,
  "\\": 983,
  "NCCCc": 984,
  "ClCc": 985,
  "d": 986,
  "IC": 987,
  "\u0121": 988,
  "OCCCNC": 989,
  "x": 990,
  "ccs": 991,
  "COCCNCc": 992,
  "CCCNCC": 993,
  "\u010b": 994,
  "\u011f": 995,
  "CCCSc": 996,
  "SCCN": 997,
  "\u00f2": 998,
  "OCCNc": 999,
  "NCCCSc": 1000,
  "O": 1001,
  "\u00a9": 1002,
  "SCc": 1003,
  "CNCCc": 1004,
  "NCCCSC": 1005,
  "NCCCCl": 1006,
  "\u0105": 1007,
  "nncs": 1008,
  "\u013b": 1009,
  "$": 1010,
  "OCCCOc": 1011,
  "@]": 1012,
  "CCCCCCCCCCC": 1013,
  "ssc": 1014,
  "12": 1015,
  "7": 1016,
  "](/[": 1017,
  "OCCS": 1018,
  "CSc": 1019,
  "G": 1020,
  "CCBr": 1021,
  "OCCn": 1022,
  "OCCCCn": 1023,
  "g": 1024,
  "123": 1025,
  "NCCCOCC": 1026,
  "CCCS": 1027,
  "@@](=": 1028,
  "CCNS": 1029,
  "E": 1030,
  "CNS": 1031,
  "\u013c": 1032,
  "COCCOCCNC": 1033,
  "NCCCCN": 1034,
  "+]": 1035,
  "CCOCCCNC": 1036,
  "NNS": 1037,
  "occc": 1038,
  "OCCOCCOCCOCCO": 1039,
  "+](/": 1040,
  "CCOCc": 1041,
  "&": 1042,
  "CCCl": 1043,
  "nnn": 1044,
  "-][": 1045,
  "Sc": 1046,
  "r": 1047,
  "31": 1048,
  "i": 1049,
  "COCCC": 1050,
  "-": 1051,
  "NCCOCc": 1052,
  "CCCCc": 1053,
  "9": 1054,
  "CCONC": 1055,
  "nnco": 1056,
  "nnc": 1057,
  "COCCn": 1058,
  "\u00a1": 1059,
  "'": 1060,
  "COCCOCC": 1061,
  "\u00ca": 1062,
  "nc": 1063,
  "\u00f5": 1064,
  "On": 1065,
  "\u00d7": 1066,
  "CCS": 1067,
  "+])[": 1068,
  "L": 1069,
  "Cc": 1070,
  "CCCSCc": 1071,
  "32": 1072,
  "nscc": 1073,
  "ncnn": 1074,
  "SCCc": 1075,
  "ncc": 1076,
  "onc": 1077,
  "COCCS": 1078,
  "COCCOc": 1079,
  "CSCCn": 1080,
  "ccoc": 1081,
  "CSCCNC": 1082,
  "oncc": 1083,
  "scnc": 1084,
  "OCCNC": 1085,
  "CCOCCOCC": 1086,
  "COS": 1087,
  "\u00eb": 1088,
  "41": 1089,
  "cs": 1090,
  "OCCCN": 1091,
  "OCCCO": 1092,
  "COn": 1093,
  "\u00b9": 1094,
  "+][": 1095,
  "nccnc": 1096,
  "CCc": 1097,
  ")/[": 1098,
  "COCc": 1099,
  "e": 1100,
  "CCOCCS": 1101,
  "CSCC": 1102,
  "-]=[": 1103,
  "\u00e5": 1104,
  "ncco": 1105,
  "cnco": 1106,
  "\u00e1": 1107,
  "8": 1108,
  "ncncc": 1109,
  "ncn": 1110,
  "U": 1111,
  "J": 1112,
  ")/": 1113,
  "=[": 1114,
  "NCCCC": 1115,
  "CSCCCNc": 1116,
  "no": 1117,
  "cccnc": 1118,
  "\u013d": 1119,
  "CCOCCNc": 1120,
  "\u00f6": 1121,
  "Nn": 1122,
  "CCCCCCS": 1123,
  "Nc": 1124,
  "nccs": 1125,
  "CSCCOc": 1126,
  "\u0129": 1127,
  "CCOCCn": 1128,
  "]([": 1129,
  "\u00e9": 1130,
  "312": 1131,
  "\u00c6": 1132,
  "/[": 1133,
  "coc": 1134,
  "cnoc": 1135,
  "CCCCCN": 1136,
  "NCC": 1137,
  "ncccc": 1138,
  "+](": 1139,
  "ClCCCSc": 1140,
  "W": 1141,
  "cccn": 1142,
  "SCCCc": 1143,
  "ccncn": 1144,
  "OCn": 1145,
  "cscn": 1146,
  "\u0136": 1147,
  "BrCC": 1148,
  "ncoc": 1149,
  "COCCCOC": 1150,
  "\u00c4": 1151,
  "COCO": 1152,
  "\u0128": 1153,
  "NCCN": 1154,
  "5": 1155,
  "\u00b8": 1156,
  "csc": 1157,
  "\u00ee": 1158,
  "+](/[": 1159,
  "h": 1160,
  "R": 1161,
  "CCSCC": 1162,
  "NCCCO": 1163,
  "COCCOC": 1164,
  ")=[": 1165,
  "\u00c3": 1166,
  "CCCn": 1167,
  "SCCOc": 1168,
  "24": 1169,
  "\u00b5": 1170,
  "CCOCCSc": 1171,
  "NCCOCCO": 1172,
  "n": 1173,
  "sccn": 1174,
  "NCCCCOc": 1175,
  "\u00cd": 1176,
  "COCCNS": 1177,
  "NCCc": 1178,
  "CSCCO": 1179,
  "\u00a3": 1180,
  "CSCCC": 1181,
  "ccsc": 1182,
  "(-[": 1183,
  "OCCSC": 1184,
  "sn": 1185,
  "NCCCNS": 1186,
  "cnc": 1187,
  "-])=[": 1188,
  "CCCCCn": 1189,
  "\\[": 1190,
  ")([": 1191,
  "CSC": 1192,
  "NCCSCC": 1193,
  "ccccn": 1194,
  "CCSCCOC": 1195,
  "CCSc": 1196,
  "CNCc": 1197,
  "\u011e": 1198,
  "CCOP": 1199,
  "\u00c9": 1200,
  "Cl": 1201,
  "csnn": 1202,
  "\u00ed": 1203,
  "CCOCCO": 1204,
  "6": 1205,
  "\u00c5": 1206,
  "\u00dc": 1207,
  "CCOCCCN": 1208,
  "-]": 1209,
  "OCOC": 1210,
  "COCCCCN": 1211,
  "]/": 1212,
  "CSCCN": 1213,
  "\u00c2": 1214,
  "CSCCCCNC": 1215,
  "CCCCS": 1216,
  "\u0108": 1217,
  "\u00fb": 1218,
  "CCCCCCNC": 1219,
  "CCNCc": 1220,
  "ccn": 1221,
  "+])(": 1222,
  "\u00a2": 1223,
  "NOCc": 1224,
  "-])": 1225,
  "CCCSC": 1226,
  "OCCOC": 1227,
  "OCCSCC": 1228,
  "\u00f9": 1229,
  "CCCc": 1230,
  ":": 1231,
  "\u013e": 1232,
  "NCCCNC": 1233,
  "\u00df": 1234,
  "snnc": 1235,
  ".": 1236,
  "NCCCn": 1237,
  "\u00c0": 1238,
  "\u0104": 1239,
  "CS": 1240,
  "\u010d": 1241,
  "OCO": 1242,
  "COCCNc": 1243,
  "CCCNCc": 1244,
  "\u00fc": 1245,
  "nn": 1246,
  "\u00bf": 1247,
  "OCCCn": 1248,
  "CCOCCOC": 1249,
  "NOC": 1250,
  "NNN": 1251,
  ";": 1252,
  "\u00cf": 1253,
  "NCCNC": 1254,
  "\u0101": 1255,
  "OCc": 1256,
  "\u00b6": 1257,
  "+]=[": 1258,
  "CCCCCS": 1259,
  "CI": 1260,
  "CCOCCCC": 1261,
  "~": 1262,
  "CCCBr": 1263,
  "CCOCCC": 1264,
  "+]\\": 1265,
  "CCSCc": 1266,
  ")(/": 1267,
  "D": 1268,
  "OCCNS": 1269,
  "\u00da": 1270,
  "_": 1271,
  "\u00f7": 1272,
  "CCOCCOCCOCC": 1273,
  "cn": 1274,
  "NCCCCC": 1275,
  "CCCCSC": 1276,
  "+]/": 1277,
  "ON": 1278,
  "NO": 1279,
  "ClC": 1280,
  "CCSCCC": 1281,
  "CCn": 1282,
  "CCCCCOC": 1283,
  "+](=": 1284,
  "SH": 1285,
  "SCCNC": 1286,
  "ccncc": 1287,
  "OCCOCC": 1288,
  "*": 1289,
  "\u00d1": 1290,
  "\u0123": 1291,
  "CNN": 1292,
  "\u0137": 1293,
  "\u00fe": 1294,
  "\u00dd": 1295,
  "NS": 1296,
  "\u010c": 1297,
  "\u0134": 1298,
  "scc": 1299,
  "BrCCC": 1300,
  "SN": 1301,
  "I": 1302,
  "OCCSCc": 1303,
  "NCCO": 1304,
  "CCCCCNC": 1305,
  "NCCCOC": 1306,
  "ssnc": 1307,
  "\u00ce": 1308,
  "FC": 1309,
  "\u013f": 1310,
  "\u00ef": 1311,
  "ncccn": 1312,
  "#": 1313,
  "Cn": 1314,
  "\u011b": 1315,
  "-])([": 1316,
  "NN": 1317,
  "NNC": 1318,
  "OCCCl": 1319,
  "CCCF": 1320,
  "21": 1321,
  "SCCOC": 1322,
  "/": 1323,
  "nonc": 1324,
  "CNn": 1325,
  "CCOCC": 1326,
  "y": 1327,
  "\u00a5": 1328,
  "\u0126": 1329,
  "on": 1330,
  "\u00d0": 1331,
  "CSCCc": 1332,
  "CCCNc": 1333,
  "+])([": 1334,
  "OCCCSC": 1335,
  "(-": 1336,
  "B": 1337,
  "COCCSc": 1338,
  "CCCNC": 1339,
  "-]/": 1340,
  "cncn": 1341,
  "OS": 1342,
  "\u0133": 1343,
  "S": 1344,
  "COCCCN": 1345,
  "cnns": 1346,
  "NCCCCCC": 1347,
  "\u0141": 1348,
  "CCNCC": 1349,
  "\u00ec": 1350,
  "noc": 1351,
  "\u012a": 1352,
  "CSCc": 1353,
  "\u00cc": 1354,
  "OP": 1355,
  "CCCNS": 1356,
  "\u00a7": 1357,
  "\u0112": 1358,
  "NCCOC": 1359,
  "OCCF": 1360,
  "\u00e7": 1361,
  "SCCCO": 1362,
  "\u00b4": 1363,
  "A": 1364,
  "conc": 1365,
  "NCCOc": 1366,
  "NCCSCc": 1367,
  "CSCN": 1368,
  "NH": 1369,
  ")=": 1370,
  "occ": 1371,
  "ncnc": 1372,
  "SCCCOc": 1373,
  "-[": 1374,
  "+])": 1375,
  "\u00d5": 1376,
  "V": 1377,
  "\u0103": 1378,
  "\u0142": 1379,
  "nnnc": 1380,
  "NCCSc": 1381,
  "SCCO": 1382,
  "OCCC": 1383,
  "COP": 1384,
  "nncc": 1385,
  "SC": 1386,
  "ccnnc": 1387,
  "\u0131": 1388,
  "\u0118": 1389,
  "\u00bb": 1390,
  "\u00ae": 1391,
  "nH": 1392,
  "(\\[": 1393,
  "34": 1394,
  "cnn": 1395,
  "CCNC": 1396,
  "|": 1397,
  "CCNc": 1398,
  "CONC": 1399,
  "CCSC": 1400,
  "}": 1401,
  "CCCCCc": 1402,
  "OCCOCCOCCO": 1403,
  "CCCCCCO": 1404,
  "\u00e2": 1405,
  "K": 1406,
  "@@]([": 1407,
  "NCCCOc": 1408,
  "\u0122": 1409,
  "P": 1410,
  "nsnc": 1411,
  "\u00d8": 1412,
  ")\\": 1413,
  "54": 1414,
  "CCCCOCC": 1415,
  "+]([": 1416,
  "\u00e8": 1417,
  "CSCCS": 1418,
  "ClCC": 1419,
  "CCCCOC": 1420,
  "\u00de": 1421,
  "cncs": 1422,
  "CCCCCO": 1423,
  "\u00af": 1424,
  "\u00d3": 1425,
  "ccnn": 1426,
  "-])\\": 1427,
  "(=[": 1428,
  "\u0114": 1429,
  "sccc": 1430,
  "cnnn": 1431,
  "l": 1432,
  "\u00a8": 1433,
  "CCCOc": 1434,
  "COCCNC": 1435,
  "COCCOCCN": 1436,
  "CCCCO": 1437,
  "cnccc": 1438,
  "nnccc": 1439,
  "](/": 1440,
  "(/[": 1441,
  "\u0127": 1442,
  "\u00f3": 1443,
  "NCCCS": 1444,
  "{": 1445,
  "cscc": 1446,
  "CCSS": 1447,
  "CCCCCSc": 1448,
  "a": 1449,
  "\u00b0": 1450,
  "(\\": 1451,
  "\u00c8": 1452,
  "sc": 1453,
  "+](-": 1454,
  "Brc": 1455,
  "COCCO": 1456,
  "\u012c": 1457,
  "Oc": 1458,
  "nncn": 1459,
  ">": 1460,
  "\u0110": 1461,
  "\u010e": 1462,
  "NCCCNc": 1463,
  "COCCCOc": 1464,
  "\u010a": 1465,
  "CCCOCc": 1466,
  "+]=": 1467,
  "oc": 1468,
  "\u00b1": 1469,
  "\u0139": 1470,
  ")(": 1471,
  "\u00ea": 1472,
  "\u00b2": 1473,
  "CSCCCNC": 1474,
  "cnccn": 1475,
  "\u00ff": 1476,
  "45": 1477,
  "OCCOc": 1478,
  "][": 1479,
  "COCCCS": 1480,
  "@@](": 1481,
  "NCCS": 1482,
  "\u00e4": 1483,
  "co": 1484,
  "\u0106": 1485,
  "\u00f0": 1486,
  "\u0125": 1487,
  "23": 1488,
  "SCn": 1489,
  "SCCCS": 1490,
  "COCCSCc": 1491,
  "OH": 1492,
  "\u00bd": 1493,
  "\u00fd": 1494,
  "0": 1495,
  "Y": 1496,
  "\u00e3": 1497,
  "cccs": 1498,
  "^": 1499,
  "NSC": 1500,
  "@](": 1501,
  "s": 1502,
  "OCCCC": 1503,
  "?": 1504,
  "BrCc": 1505,
  "\u0132": 1506,
  "CCCCCOc": 1507
}