{
  "<s>": 0,
  "</s>": 1,
  "<pad>": 2,
  "<unk>": 3,
  "<mask>": 4,
  "[=C] [Branch1] [=Branch2] [C] [Branch1] [C] [F] [Branch1]": 5,
  "[Branch1] [=Branch1] [N+1] [=Branch1] [C] [=O] [O-1] [=C]": 6,
  "[=C] [Branch1] [=Branch1] [N+1] [=Branch1] [C] [=O] [O-1]": 7,
  "[C] [=Branch1] [C] [=O] [N] [C@@H1] [Branch1] [#Branch1]": 8,
  "[C] [Branch1] [=Branch2] [C] [Branch1] [C] [F] [Branch1]": 9,
  "[C] [Branch1] [=Branch1] [N+1] [=Branch1] [C] [=O] [O-1]": 10,
  "[Branch1] [=Branch2] [C] [Branch1] [C] [F] [Branch1] [C]": 11,
  "[=Branch1] [C] [=O] [N] [C@@H1] [Branch1] [#Branch1] [C]": 12,
  "[=Branch1] [C] [=O] [N] [C@@H1] [Branch1] [#Branch2] [C]": 13,
  "[Branch1] [=Branch1] [N+1] [=Branch1] [C] [=O] [O-1] [C]": 14,
  "[C] [=Branch1] [C] [=O] [N] [C@@H1] [Branch1] [#Branch2]": 15,
  "[=Branch1] [N+1] [=Branch1] [C] [=O] [O-1] [=C] [Ring1]": 16,
  ".[Na+1] .[Na+1] .[Na+1] .[Na+1] .[Na+1] .[Na+1] .[Na+1]": 17,
  "[C] [=C] [Branch1] [=Branch1] [N+1] [=Branch1] [C] [=O]": 18,
  "[C] [=C] [C] [=Branch1] [Ring2] [=C] [Ring1] [=Branch1]": 19,
  "[=Branch1] [C] [=O] [C@H1] [Branch1] [#Branch2] [C] [C]": 20,
  "[C] [=Branch1] [C] [=O] [C@H1] [Branch1] [#Branch2] [C]": 21,
  "[N] [C] [=Branch1] [C] [=O] [C@H1] [Branch1] [#Branch2]": 22,
  "[N] [C] [=Branch1] [C] [=O] [C@H1] [Branch1] [#Branch1]": 23,
  "[=Branch1] [C] [=O] [O-1] [C] [=C] [Ring1] [=Branch2]": 24,
  "[=Branch1] [C] [=O] [N] [C@@H1] [Branch1] [#Branch1]": 25,
  "[=Branch1] [C] [=O] [N] [C@@H1] [Branch1] [#Branch2]": 26,
  "[Branch1] [=Branch1] [N+1] [=Branch1] [C] [=O] [O-1]": 27,
  "[=Branch1] [N+1] [=Branch1] [C] [=O] [O-1] [C] [=C]": 28,
  "[=C] [Branch1] [C] [Br] [C] [=C] [Ring1] [#Branch1]": 29,
  "[=C] [C] [Branch1] [C] [Cl] [=C] [Ring1] [#Branch1]": 30,
  "[=C] [Ring1] [=Branch1] [C] [=Branch1] [C] [=O] [N]": 31,
  "[C] [=C] [Ring1] [=Branch1] [C] [=Branch1] [C] [=O]": 32,
  "[=C] [Branch1] [C] [Cl] [C] [=C] [Ring1] [#Branch1]": 33,
  "[=C] [C] [=Branch1] [Ring2] [=C] [Ring1] [=Branch1]": 34,
  "[=C] [Branch1] [C] [F] [C] [=C] [Ring1] [#Branch1]": 35,
  "[=C] [Branch1] [C] [O] [C] [=C] [Ring1] [#Branch1]": 36,
  "[Branch1] [C] [Cl] [C] [=C] [Ring1] [#Branch1] [C]": 37,
  "[=Branch2] [C] [Branch1] [C] [F] [Branch1] [C] [F]": 38,
  "[C] [=O] [N] [C@@H1] [Branch1] [#Branch2] [C] [C]": 39,
  "[=C] [C] [=C] [C] [=Branch1] [Ring2] [=C] [Ring1]": 40,
  "[C] [C] [C@H1] [Branch1] [C] [C] [C@H1] [Branch2]": 41,
  "[Branch1] [C] [F] [F] [C] [=C] [Ring1] [#Branch2]": 42,
  "[=Branch1] [C] [=O] [=Branch1] [C] [=O] [C] [=C]": 43,
  "[Branch1] [=Branch1] [C] [=Branch1] [C] [=O] [O]": 44,
  "[N+1] [=Branch1] [C] [=O] [O-1] [C] [=C] [Ring1]": 45,
  "[=Branch1] [C] [=O] [C] [=C] [C] [=C] [Branch1]": 46,
  "[=Branch1] [C] [=O] [=Branch1] [C] [=O] [N] [C]": 47,
  "[=C] [Ring1] [=Branch1] [C] [=Branch1] [C] [=O]": 48,
  "[=Branch1] [N+1] [=Branch1] [C] [=O] [O-1] [=C]": 49,
  "[C] [S] [=Branch1] [C] [=O] [=Branch1] [C] [=O]": 50,
  "[S] [=Branch1] [C] [=O] [=Branch1] [C] [=O] [C]": 51,
  ".[Na+1] .[Na+1] .[Na+1] .[Na+1] .[Na+1] .[Na+1]": 52,
  "[S] [=Branch1] [C] [=O] [=Branch1] [C] [=O] [N]": 53,
  "[Branch1] [=Branch2] [C] [=C] [C] [=C] [C] [=C]": 54,
  "[Ring1] [=Branch1] [N] [C] [=Branch1] [C] [=O]": 55,
  "[Branch1] [=Branch1] [N+1] [=Branch1] [C] [=O]": 56,
  "[=Branch1] [N+1] [=Branch1] [C] [=O] [O-1] [C]": 57,
  "[C] [C] [Branch1] [C] [C] [C] [C@H1] [Branch2]": 58,
  "[Branch1] [C] [Cl] [C] [=C] [Ring1] [#Branch1]": 59,
  "[Ring1] [=Branch1] [C] [=Branch1] [C] [=O] [N]": 60,
  "[Branch1] [#Branch2] [C] [C] [=C] [C] [=C] [C]": 61,
  "[C] [=Branch1] [Ring2] [=C] [Ring1] [=Branch1]": 62,
  "[C] [C] [=C] [C] [=C] [C] [=Ring1] [=Branch1]": 63,
  "[O] [=C] [Branch2] [Ring1] [#Branch1] [N] [C]": 64,
  "[Branch1] [C] [F] [C] [=C] [Ring1] [#Branch1]": 65,
  "[C] [O] [C] [=C] [C] [=C] [Branch2] [Branch1]": 66,
  "[=C] [C] [=C] [C] [=C] [Ring1] [=Branch1] [N]": 67,
  "[=Branch2] [C] [=C] [C] [=C] [C] [=C] [Ring1]": 68,
  "[=O] [N] [C@@H1] [Branch1] [#Branch2] [C] [C]": 69,
  "[C] [=C] [C] [=C] [C] [=C] [Ring1] [=Branch1]": 70,
  "[C] [=C] [C] [=C] [Ring1] [=Branch1] [C] [=C]": 71,
  "[C] [=Branch1] [C] [=O] [N] [C@@H1] [Branch1]": 72,
  "[=C] [C] [=C] [C] [=C] [Ring1] [=Branch1] [C]": 73,
  "[Branch1] [C] [O] [C] [=C] [Ring1] [#Branch1]": 74,
  "[C] [=C] [C] [=Branch1] [Ring2] [=C] [Ring1]": 75,
  "[N] [C] [=Branch1] [C] [=O] [C@H1] [Branch1]": 76,
  "[C] [=C] [Branch1] [C] [Cl] [C] [=C] [Ring1]": 77,
  "[Branch1] [C] [F] [Branch1] [C] [F] [F] [=C]": 78,
  "[O] [=C] [Branch2] [Ring1] [Branch1] [N] [C]": 79,
  "[O] [=C] [Branch1] [C] [O] [C] [Branch1] [C]": 80,
  "[C] [=C] [Branch1] [C] [F] [C] [=C] [Ring1]": 81,
  "[S] [=Branch1] [C] [=O] [=Branch1] [C] [=O]": 82,
  "[Branch1] [C] [O] [C] [Branch1] [C] [O] [C]": 83,
  "[O] [=C] [Branch1] [Ring1] [O] [C] [C] [=C]": 84,
  "[C] [Branch1] [C] [O] [C] [Branch1] [C] [O]": 85,
  "[C] [O] [C] [=C] [C] [=C] [Branch2] [Ring1]": 86,
  "[=Branch1] [C] [=O] [=Branch1] [C] [=O] [C]": 87,
  "[C] [C] [Branch1] [C] [C] [Branch1] [C] [C]": 88,
  "[C] [Branch1] [C] [F] [Branch1] [C] [F] [F]": 89,
  "[C] [O] [C] [=C] [C] [=C] [Branch2] [Ring2]": 90,
  "[Branch1] [C] [F] [Branch1] [C] [F] [F] [C]": 91,
  "[=Branch1] [C] [=O] [=Branch1] [C] [=O] [N]": 92,
  "[F] [Branch1] [C] [F] [F] [C] [=C] [Ring1]": 93,
  "[Ring1] [=Branch1] [C] [=Branch1] [C] [=O]": 94,
  "[O] [=C] [Branch1] [Ring1] [O] [C] [C] [C]": 95,
  "[Branch1] [=Branch2] [C] [Branch1] [C] [F]": 96,
  "[O] [=C] [Branch2] [Ring1] [Ring2] [N] [C]": 97,
  "[Branch1] [#Branch2] [C] [C] [=C] [C] [=C]": 98,
  "[=Branch1] [N+1] [=Branch1] [C] [=O] [O-1]": 99,
  "[C] [F] [Branch1] [C] [F] [F] [=C] [Ring1]": 100,
  "[Branch1] [=Branch2] [C] [=C] [C] [=C] [C]": 101,
  "[O] [=C] [Branch2] [Ring1] [Ring1] [N] [C]": 102,
  "[C] [C] [Branch1] [C] [C] [C@H1] [Branch2]": 103,
  "[O] [=C] [Branch1] [Ring2] [O] [C] [C] [C]": 104,
  "[=C] [C] [=C] [C] [=C] [Ring1] [=Branch1]": 105,
  "[C] [=Branch1] [C] [=O] [C] [=C] [C] [=C]": 106,
  "[=Branch1] [C] [=O] [C] [=C] [C] [=C] [C]": 107,
  "[=Branch1] [C] [=O] [N] [C@@H1] [Branch1]": 108,
  "[C] [=C] [C] [=C] [C] [=Ring1] [=Branch1]": 109,
  "[#Branch2] [C] [C] [=C] [C] [=C] [C] [=C]": 110,
  "[=C] [C] [=C] [Branch1] [C] [Cl] [C] [=C]": 111,
  "[O] [=C] [Branch1] [#Branch2] [N] [C] [C]": 112,
  "[C] [C] [N] [Branch1] [Ring1] [C] [C] [C]": 113,
  "[=Branch1] [C] [=O] [N] [C] [=C] [C] [=C]": 114,
  "[=C] [C] [=C] [Ring1] [=Branch1] [C] [=C]": 115,
  "[O] [=C] [Branch1] [C] [O] [C] [Branch2]": 116,
  "[C] [=C] [C] [=C] [Branch1] [C] [Cl] [C]": 117,
  "[C] [=C] [C] [=Branch1] [C] [=O] [N] [C]": 118,
  "[C] [=Branch1] [C] [=O] [C@H1] [Branch1]": 119,
  "[C] [N] [C] [=Branch1] [C] [=O] [C] [=C]": 120,
  "[N+1] [=Branch1] [C] [=O] [O-1] [C] [=C]": 121,
  "[C] [=Branch1] [C] [=O] [N] [C] [=C] [C]": 122,
  "[C] [=C] [C] [=C] [Ring1] [=Branch1] [N]": 123,
  "[C] [O] [C] [=Branch1] [C] [=O] [C] [=C]": 124,
  "[C] [=C] [C] [=C] [Ring1] [=Branch1] [C]": 125,
  "[=C] [C] [=C] [Branch1] [C] [F] [C] [=C]": 126,
  "[=C] [Branch1] [C] [Cl] [C] [=C] [Ring1]": 127,
  "[N] [#C] [C] [=C] [C] [=C] [C] [Branch2]": 128,
  "[C] [C] [=Branch1] [C] [=O] [N] [C] [C]": 129,
  "[Branch1] [C] [F] [Branch1] [C] [F] [F]": 130,
  "[C] [C] [C@H1] [Branch1] [C] [C] [C@H1]": 131,
  "[O] [=C] [C] [=C] [Branch1] [C] [O] [C]": 132,
  "[C] [O] [C] [=C] [C] [=C] [C] [Branch2]": 133,
  "[C] [C] [O] [C] [=C] [C] [=C] [Branch2]": 134,
  "[Branch1] [C] [O] [C] [Branch1] [C] [O]": 135,
  "[=O] [C] [=C] [C] [=C] [C] [=C] [Ring1]": 136,
  "[C] [Branch1] [C] [F] [Branch1] [C] [F]": 137,
  "[C] [C] [=C] [C] [=C] [Branch2] [Ring1]": 138,
  "[C] [O] [C] [=Branch1] [C] [=O] [N] [C]": 139,
  "[C] [O] [C] [=Branch1] [C] [=O] [C@@H1]": 140,
  "[O] [=C] [Branch1] [C] [O] [C] [=C] [C]": 141,
  "[=C] [Branch1] [C] [F] [C] [=C] [Ring1]": 142,
  "[C] [=Branch1] [C] [=O] [N] [C] [C] [C]": 143,
  "[C] [=C] [C] [=C] [Branch1] [C] [O] [C]": 144,
  "[C] [C] [O] [C] [=Branch1] [C] [=O] [C]": 145,
  "[C] [C] [=C] [C] [Branch1] [C] [C] [=C]": 146,
  "[C] [C] [C] [=Branch1] [C] [=O] [N] [C]": 147,
  "[C] [O] [C] [=C] [C] [=C] [Branch1] [C]": 148,
  ".[Na+1] .[Na+1] .[Na+1] .[Na+1] .[Na+1]": 149,
  "[C] [O] [C] [=Branch1] [C] [=O] [C] [C]": 150,
  "[=Branch1] [C] [=O] [=Branch1] [C] [=O]": 151,
  "[C] [C] [=C] [C] [=C] [Branch2] [Ring2]": 152,
  "[C] [=C] [C] [=C] [Branch1] [C] [F] [C]": 153,
  "[F] [Branch1] [C] [F] [F] [=C] [Ring1]": 154,
  "[C] [O] [C] [=C] [C] [Branch2] [Ring2]": 155,
  "[O] [=C] [Branch2] [Ring1] [N] [N] [C]": 156,
  "[O] [=C] [Branch2] [Ring1] [Ring1] [C]": 157,
  "[C] [C] [Branch1] [C] [C] [=C] [C] [C]": 158,
  "[O] [=C] [Branch2] [Ring1] [C] [N] [C]": 159,
  "[Branch1] [=Branch2] [C] [=C] [C] [=C]": 160,
  "[C] [O] [C] [=C] [C] [Branch2] [Ring1]": 161,
  "[C] [=C] [Branch1] [Ring1] [O] [C] [C]": 162,
  "[S] [=Branch1] [C] [=O] [=Branch1] [C]": 163,
  "[O] [=C] [Branch1] [C] [O] [C] [O] [C]": 164,
  "[O] [=S] [=Branch1] [C] [=O] [Branch2]": 165,
  "[O] [=C] [Branch1] [C] [O] [C] [C] [C]": 166,
  "[C] [F] [Branch1] [C] [F] [F] [C] [=C]": 167,
  "[O] [=S] [=Branch1] [C] [=O] [Branch1]": 168,
  "[O] [=C] [Branch1] [Ring1] [O] [C] [C]": 169,
  "[O] [=C] [Branch2] [Ring1] [=Branch2]": 170,
  "[O] [=C] [Branch2] [Ring1] [#Branch1]": 171,
  "[O] [=C] [Branch2] [Ring1] [#Branch2]": 172,
  "[C] [N] [Branch1] [C] [C] [C] [C] [C]": 173,
  "[O] [=C] [Branch2] [Ring2] [#Branch2]": 174,
  "[O] [=C] [Branch2] [Ring1] [=Branch1]": 175,
  "[O] [=C] [Branch2] [Ring2] [=Branch2]": 176,
  "[O] [=C] [Branch2] [Ring2] [=Branch1]": 177,
  "[O] [=C] [Branch1] [#Branch1] [N] [C]": 178,
  "[O] [=C] [Branch1] [#Branch2] [N] [C]": 179,
  "[=Branch1] [C] [=O] [C] [=C] [C] [=C]": 180,
  "[=Branch2] [C] [=C] [C] [=C] [C] [=C]": 181,
  "[O] [=C] [Branch2] [Ring2] [#Branch1]": 182,
  "[=C] [C] [=C] [C] [=Ring1] [=Branch1]": 183,
  "[C] [C] [Branch1] [C] [C] [C] [C@@H1]": 184,
  "[C] [C] [=C] [C] [=Branch1] [C] [=O]": 185,
  "[N+1] [=Branch1] [C] [=O] [O-1] [=C]": 186,
  "[C] [C] [=Branch1] [C] [=O] [C] [=C]": 187,
  "[C] [=Branch1] [C] [=O] [N] [C] [=C]": 188,
  "[C] [=C] [C] [=Branch1] [C] [=O] [O]": 189,
  "[O] [=C] [Branch2] [Ring1] [Branch2]": 190,
  "[=C] [C] [=C] [Branch1] [C] [Cl] [C]": 191,
  "[=Branch1] [C] [=O] [C@H1] [Branch1]": 192,
  "[C] [=C] [C] [=C] [Branch1] [C] [Cl]": 193,
  "[O] [=C] [Branch2] [Ring1] [Branch1]": 194,
  "[O] [=C] [Branch2] [Ring2] [Branch2]": 195,
  "[C] [=Branch1] [C] [=O] [C] [=C] [C]": 196,
  "[C] [=C] [C] [=C] [Ring1] [=Branch1]": 197,
  "[=C] [C] [=C] [Ring1] [=Branch1] [C]": 198,
  "[=C] [C] [=C] [Ring1] [=Branch1] [N]": 199,
  "[C] [=C] [Branch1] [C] [Cl] [C] [=C]": 200,
  "[C] [Cl] [C] [=C] [Ring1] [#Branch1]": 201,
  "[O] [=C] [Branch2] [Ring2] [Branch1]": 202,
  "[C] [C] [Branch1] [C] [C] [C] [C@H1]": 203,
  "[=Branch1] [C] [=O] [N] [C] [=C] [C]": 204,
  "[N] [#C] [C] [=C] [C] [=C] [Branch2]": 205,
  "[N+1] [=Branch1] [C] [=O] [O-1] [C]": 206,
  "[Branch1] [C] [O] [C] [Branch1] [C]": 207,
  "[C] [=C] [C] [=C] [Branch2] [Ring1]": 208,
  "[O] [=C] [O] [C] [=C] [C] [Branch1]": 209,
  "[C] [C] [C] [=C] [C] [=C] [Branch2]": 210,
  "[C] [Branch1] [C] [F] [Branch1] [C]": 211,
  "[C] [N] [C] [=Branch1] [C] [=O] [C]": 212,
  "[C] [C] [O] [C] [=Branch1] [C] [=O]": 213,
  "[C] [=C] [C] [=C] [Branch2] [Ring2]": 214,
  "[C] [C] [N] [C] [=Branch1] [C] [=O]": 215,
  "[C] [O] [C] [=Branch1] [C] [=O] [N]": 216,
  "[C] [N] [C] [=Branch1] [C] [=O] [N]": 217,
  "[C] [C] [=C] [C] [=C] [Branch1] [C]": 218,
  "[O] [=C] [Branch1] [#C] [N] [C] [C]": 219,
  "[C] [C] [=Branch1] [C] [=O] [N] [C]": 220,
  "[C] [O] [C] [=C] [C] [=C] [Branch2]": 221,
  "[C] [O] [C] [=C] [C] [=C] [Branch1]": 222,
  "[=C] [C] [=C] [Branch1] [C] [F] [C]": 223,
  "[C] [O] [C] [=Branch1] [C] [=O] [C]": 224,
  "[C] [C] [=Branch1] [C] [=O] [O] [C]": 225,
  "[C] [C] [C] [C] [=Branch1] [C] [=O]": 226,
  "[O] [=C] [Branch1] [C] [O] [C] [=C]": 227,
  "[C] [=Branch1] [C] [=O] [N] [C@@H1]": 228,
  "[C] [F] [C] [=C] [Ring1] [#Branch1]": 229,
  "[N] [C] [=Branch1] [C] [=O] [C@@H1]": 230,
  "[C] [C] [=C] [C] [=C] [C] [Branch2]": 231,
  "[Branch1] [C] [Cl] [C] [=C] [Ring1]": 232,
  "[C] [=C] [C] [=C] [Branch1] [C] [F]": 233,
  "[C] [=C] [Branch1] [C] [F] [C] [=C]": 234,
  "[Branch1] [C] [F] [Branch1] [C] [F]": 235,
  "[C] [=Branch1] [C] [=O] [N] [C] [C]": 236,
  "[C] [C] [Branch1] [C] [C] [Branch2]": 237,
  "[=Branch1] [C] [=O] [N] [C] [C] [C]": 238,
  "[=Branch1] [C] [=Branch1] [C] [=O]": 239,
  "[C] [=C] [C] [=C] [C] [=C] [Ring1]": 240,
  "[N] [C] [=Branch1] [C] [=O] [C@H1]": 241,
  "[C] [C] [=C] [C] [Branch1] [C] [C]": 242,
  "[=C] [Branch1] [Ring1] [O] [C] [C]": 243,
  "[O] [=C] [Branch1] [N] [N] [C] [C]": 244,
  "[C] [O] [C] [=C] [C] [=C] [C] [=C]": 245,
  "[=Branch1] [C] [=O] [=Branch1] [C]": 246,
  "[O] [=C] [O] [C] [=C] [C] [=C] [C]": 247,
  "[O] [=C] [Branch2] [Ring2] [Ring2]": 248,
  "[O] [=C] [Branch2] [Ring2] [Ring1]": 249,
  "[C] [Branch1] [Ring1] [O] [C] [=C]": 250,
  "[O] [=C] [Branch2] [Ring1] [Ring2]": 251,
  "[C] [O] [C] [=C] [C] [Branch1] [C]": 252,
  "[C] [F] [Branch1] [C] [F] [F] [=C]": 253,
  "[F] [Branch1] [C] [F] [F] [C] [=C]": 254,
  "[O] [=C] [C] [C] [Branch1] [C] [O]": 255,
  "[S] [=Branch1] [C] [=O] [=Branch1]": 256,
  "[O] [=C] [Branch2] [Ring1] [C] [C]": 257,
  "[C] [O] [C] [=C] [C] [=C] [N] [=C]": 258,
  "[O] [=C] [Branch2] [Ring1] [Ring1]": 259,
  "[O] [=C] [Branch1] [O] [N] [C] [C]": 260,
  "[O] [=C] [Branch1] [C] [O] [C] [C]": 261,
  "[C] [N] [Branch1] [C] [C] [C] [C]": 262,
  "[C] [C] [Branch1] [C] [C] [C] [C]": 263,
  "[C] [C] [N] [C] [C] [N] [Branch2]": 264,
  "[O] [=C] [Branch1] [=Branch2] [C]": 265,
  "[C] [O] [C] [Branch1] [C] [O] [C]": 266,
  "[C] [C] [O] [C] [=C] [C] [=C] [C]": 267,
  "[C] [F] [Branch1] [C] [F] [F] [C]": 268,
  "[C] [C] [Branch1] [C] [C] [O] [C]": 269,
  "[C] [C] [Branch1] [C] [C] [C@@H1]": 270,
  "[Branch1] [=Branch2] [C] [=C] [C]": 271,
  "[C] [C] [C] [O] [C] [=C] [C] [=C]": 272,
  "[C] [C] [Branch1] [C] [C] [C] [N]": 273,
  "[C] [C] [Branch1] [C] [C] [N] [C]": 274,
  "[C] [C] [Branch1] [C] [C] [C@H1]": 275,
  "[O] [=C] [C] [=C] [C] [=Branch2]": 276,
  "[Cl] [C] [=C] [Ring1] [#Branch1]": 277,
  "[O] [=C] [C] [=Branch1] [C] [=O]": 278,
  "[C] [=C] [C] [=Branch1] [C] [=O]": 279,
  "[C] [=Branch1] [C] [=O] [C] [=C]": 280,
  "[=C] [Branch1] [C] [Cl] [C] [=C]": 281,
  "[=Branch1] [C] [=O] [N] [C] [=C]": 282,
  "[=Branch1] [C] [=O] [C] [=C] [C]": 283,
  "[=C] [C] [=C] [Ring1] [=Branch1]": 284,
  "[C] [C] [C@H1] [Branch1] [C] [C]": 285,
  "[Cl] [C] [=C] [C] [=C] [Branch2]": 286,
  "[=Branch2] [C] [=C] [C] [=C] [C]": 287,
  "[=C] [C] [=C] [Branch1] [C] [Cl]": 288,
  "[F] [C] [=C] [C] [=C] [Branch2]": 289,
  "[C] [C] [C] [=Branch1] [C] [=O]": 290,
  "[C] [C] [=Branch1] [C] [=O] [C]": 291,
  "[C] [=C] [Ring1] [#Branch1] [C]": 292,
  "[=C] [Branch1] [C] [O] [C] [=C]": 293,
  "[C] [N] [C] [=Branch1] [C] [=O]": 294,
  "[O] [=C] [Branch2] [Ring1] [#C]": 295,
  "[O] [=C] [Branch2] [Ring2] [=N]": 296,
  "[O] [=C] [C] [=C] [C] [Branch2]": 297,
  "[=Branch1] [C] [=O] [N] [C] [C]": 298,
  "[O] [=C] [Branch1] [=N] [N] [C]": 299,
  "[O] [=C] [O] [C] [=C] [Branch2]": 300,
  "[Branch1] [C] [F] [Branch1] [C]": 301,
  "[N] [C] [=C] [C] [=C] [Branch1]": 302,
  "[O] [=C] [Branch2] [Ring1] [=N]": 303,
  "[=Branch1] [C] [=O] [N] [C@@H1]": 304,
  "[C] [=Branch1] [C] [=O] [C] [C]": 305,
  "[C] [Branch1] [C] [F] [Branch1]": 306,
  "[Branch1] [C] [O] [C] [Branch1]": 307,
  "[O] [=C] [Branch2] [Ring1] [=C]": 308,
  "[O] [C] [=C] [C] [=C] [Branch2]": 309,
  "[C] [C] [=Branch1] [C] [=O] [N]": 310,
  "[O] [=C] [C] [=C] [C] [Branch1]": 311,
  "[C] [C] [C] [C] [C] [C] [C] [C]": 312,
  "[O] [=C] [Branch1] [=C] [N] [C]": 313,
  "[O] [C] [=C] [C] [=C] [Branch1]": 314,
  "[O] [=C] [Branch1] [#C] [N] [C]": 315,
  "[C] [=C] [C] [=C] [Branch1] [C]": 316,
  "[C] [=C] [Ring1] [=Branch1] [C]": 317,
  "[O] [=C] [N] [C] [=Branch1] [C]": 318,
  "[N+1] [=Branch1] [C] [=O] [O-1]": 319,
  "[C] [=Branch1] [C] [=O] [N] [C]": 320,
  "[=C] [C] [=C] [Branch2] [Ring1]": 321,
  "[C] [C] [=C] [C] [=C] [Branch2]": 322,
  "[C] [=C] [Branch1] [C] [Cl] [C]": 323,
  "[C] [O] [C] [=Branch1] [C] [=O]": 324,
  "[C] [C] [=C] [C] [=C] [Branch1]": 325,
  "[=C] [C] [=C] [Branch1] [C] [F]": 326,
  "[O] [C] [=Branch1] [C] [=O] [C]": 327,
  "[C] [=C] [Ring1] [=Branch1] [N]": 328,
  "[F] [C] [=C] [Ring1] [#Branch1]": 329,
  "[N] [C] [=Branch1] [C] [=O] [C]": 330,
  "[C] [=Branch1] [C] [=O] [O] [C]": 331,
  "[=C] [Branch1] [C] [F] [C] [=C]": 332,
  "[C] [C] [=Branch1] [C] [=O] [O]": 333,
  "[O] [=C] [Branch2] [Ring1] [N]": 334,
  "[Branch1] [Ring1] [O] [C] [=C]": 335,
  "[=C] [C] [=C] [C] [=C] [Ring1]": 336,
  "[O] [=C] [O] [C] [=C] [C] [=C]": 337,
  "[C] [O] [C] [=C] [C] [Branch1]": 338,
  "[O] [=C] [Branch1] [S] [N] [C]": 339,
  "[F] [Branch1] [C] [F] [F] [=C]": 340,
  "[C] [=O] [C] [=C] [C] [=C] [C]": 341,
  "[C] [=C] [Branch1] [C] [F] [C]": 342,
  "[=Branch1] [C] [=O] [=Branch1]": 343,
  "[O] [=C] [C] [=C] [C] [=C] [C]": 344,
  "[C] [=C] [Branch1] [C] [O] [C]": 345,
  "[C] [=O] [N] [C] [=C] [C] [=C]": 346,
  "[C] [=Branch1] [C] [=O] [C@H1]": 347,
  "[C] [=O] [N] [C@@H1] [Branch1]": 348,
  "[C] [O] [C] [=C] [C] [Branch2]": 349,
  "[C] [C] [=C] [C] [Branch1] [C]": 350,
  "[O] [=C] [Branch1] [C] [O] [C]": 351,
  "[O] [=C] [Branch2] [Ring2] [O]": 352,
  "[O] [=C] [N] [C] [=C] [C] [=C]": 353,
  "[O] [=C] [O] [C] [C] [Branch1]": 354,
  "[O] [=C] [Branch2] [Ring1] [O]": 355,
  "[O] [=C] [C] [C] [=C] [C] [=C]": 356,
  "[O] [=C] [Branch2] [Ring1] [C]": 357,
  "[O] [=C] [O] [C] [Branch1] [C]": 358,
  "[O] [=C] [Branch1] [P] [N] [C]": 359,
  "[=C] [Branch1] [Ring1] [O] [C]": 360,
  "[O] [=C] [Branch2] [Ring2] [C]": 361,
  "[C] [O] [C] [=C] [Branch1] [C]": 362,
  "[O] [=C] [Branch1] [O] [N] [C]": 363,
  "[N] [#C] [C] [=C] [C] [=C] [C]": 364,
  "[O] [=C] [Branch2] [Ring1] [P]": 365,
  "[O] [=C] [Branch2] [Ring1] [S]": 366,
  "[O] [=C] [Branch2] [Ring2] [N]": 367,
  "[O] [=C] [Branch1] [C] [N] [C]": 368,
  "[C] [Branch1] [Ring1] [O] [C]": 369,
  "[C] [F] [Branch1] [C] [F] [F]": 370,
  "[CH0] [CH1] [CH1] [CH1] [CH1]": 371,
  "[O] [C] [Branch1] [C] [O] [C]": 372,
  "[C] [C] [O] [C] [=C] [C] [=C]": 373,
  "[C] [O] [C] [=C] [C] [=C] [C]": 374,
  "[C] [O] [C] [=C] [C] [=N] [C]": 375,
  "[F] [Branch1] [C] [F] [F] [C]": 376,
  "[O] [=C] [Branch1] [#Branch2]": 377,
  "[C] [N] [C] [C] [C] [Branch2]": 378,
  "[C] [N] [C] [C] [N] [Branch2]": 379,
  "[C] [C] [C] [C] [N] [Branch2]": 380,
  "[O] [=C] [Branch1] [#Branch1]": 381,
  "[C] [C] [Branch1] [C] [C] [C]": 382,
  "[C] [C] [C] [=C] [C] [=C] [C]": 383,
  "[C] [C] [C] [Branch1] [C] [C]": 384,
  "[C] [C] [Branch1] [C] [C] [N]": 385,
  "[O] [C] [C] [O] [C] [Branch2]": 386,
  "[C] [N] [Branch1] [C] [C] [C]": 387,
  "[O] [=C] [Branch2] [=Branch1]": 388,
  "[O] [=C] [Branch1] [=Branch2]": 389,
  "[C] [C] [C] [C] [=C] [C] [=C]": 390,
  "[O] [=C] [C] [C] [C] [=C] [C]": 391,
  "[C] [O] [C] [Branch1] [C] [O]": 392,
  "[=Branch1] [C] [=O] [C] [=C]": 393,
  "[O] [=C] [Branch1] [Branch2]": 394,
  "[O] [=S] [=Branch1] [C] [=O]": 395,
  "[C] [C] [C] [C] [C] [=N] [C]": 396,
  "[O] [=C] [Branch2] [Branch1]": 397,
  "[=Branch2] [C] [=C] [C] [=C]": 398,
  "[Branch1] [C] [Cl] [C] [=C]": 399,
  "[C] [=Branch1] [C] [=O] [O]": 400,
  "[O] [=C] [Branch1] [#C] [C]": 401,
  "[O] [=C] [Branch1] [=N] [C]": 402,
  "[C] [=C] [Ring1] [#Branch1]": 403,
  "[O] [=C] [C] [=C] [Branch1]": 404,
  "[C] [C] [=Branch1] [C] [=O]": 405,
  "[=C] [Ring1] [=Branch1] [C]": 406,
  "[=C] [Ring1] [=Branch1] [N]": 407,
  "[Branch1] [C] [F] [Branch1]": 408,
  "[C] [=C] [Ring1] [=Branch1]": 409,
  "[N] [C] [=Branch1] [C] [=O]": 410,
  "[C] [=C] [C] [=C] [Branch2]": 411,
  "[=Branch1] [C] [=O] [N] [C]": 412,
  "[C] [=C] [C] [=C] [Branch1]": 413,
  "[=C] [C] [=C] [Branch1] [C]": 414,
  "[O] [=C] [C] [=C] [Branch2]": 415,
  "[=C] [Branch1] [C] [Cl] [C]": 416,
  "[=Branch1] [C] [=O] [C] [C]": 417,
  "[O] [=C] [Branch1] [=C] [C]": 418,
  "[C] [=C] [Branch1] [C] [Cl]": 419,
  "[O] [C] [=Branch1] [C] [=O]": 420,
  "[C] [=Branch1] [C] [=O] [N]": 421,
  "[=Branch1] [C] [=O] [O] [C]": 422,
  "[C] [=Branch1] [C] [=O] [C]": 423,
  "[=C] [Ring1] [#Branch1] [C]": 424,
  "[O] [=C] [C] [=C] [C] [=C]": 425,
  "[C] [=C] [Branch1] [C] [O]": 426,
  "[C] [C] [=C] [N] [Branch2]": 427,
  "[Cl] [C] [=C] [C] [=C] [C]": 428,
  "[N] [#C] [C] [=C] [C] [=C]": 429,
  "[=C] [Branch1] [C] [O] [C]": 430,
  "[O] [=C] [Branch1] [O] [C]": 431,
  "[O] [=C] [Branch1] [S] [C]": 432,
  "[O] [=C] [Branch1] [P] [C]": 433,
  "[O] [=C] [O] [C] [Branch1]": 434,
  "[C] [=C] [Branch2] [Ring1]": 435,
  "[C] [C] [=C] [C] [Branch2]": 436,
  "[C] [C] [=N] [C] [Branch2]": 437,
  "[C] [C] [=N] [N] [Branch1]": 438,
  "[C] [C] [=C] [Branch1] [C]": 439,
  "[O] [=C] [Branch2] [Ring2]": 440,
  "[=Branch1] [C] [=O] [C@H1]": 441,
  "[C] [C] [C] [=C] [Branch2]": 442,
  "[O] [=C] [O] [C] [Branch2]": 443,
  "[O] [=C] [C] [Branch1] [C]": 444,
  "[C] [N] [C] [=C] [Branch2]": 445,
  "[C] [C] [=C] [C] [Branch1]": 446,
  "[N] [=C] [Branch1] [C] [N]": 447,
  "[O] [=C] [Branch1] [Ring1]": 448,
  "[C] [=C] [C] [=C] [C] [=C]": 449,
  "[C] [=C] [Branch1] [C] [C]": 450,
  "[=O] [N] [C@@H1] [Branch1]": 451,
  "[C] [=O] [C] [=C] [C] [=C]": 452,
  "[N] [C] [=C] [C] [=C] [C]": 453,
  "[F] [Branch1] [C] [F] [F]": 454,
  "[Branch1] [C] [C] [C] [C]": 455,
  "[O] [=C] [O] [C] [C] [=C]": 456,
  "[O] [=C] [O] [C] [=C] [C]": 457,
  "[C] [=C] [C] [=C] [Ring1]": 458,
  "[C] [O] [C] [=N] [C] [=C]": 459,
  "[C] [N] [C] [=C] [C] [=C]": 460,
  "[C] [=O] [C@H1] [Branch1]": 461,
  "[C] [O] [C] [Branch1] [C]": 462,
  "[O] [C] [C] [Branch1] [C]": 463,
  "[C] [C] [=C] [C] [=C] [C]": 464,
  "[O] [C] [=C] [C] [=C] [C]": 465,
  "[C] [Branch1] [C] [C] [C]": 466,
  "[Branch1] [Ring1] [O] [C]": 467,
  "[C] [Branch1] [C] [O] [C]": 468,
  "[C] [F] [Branch1] [C] [F]": 469,
  "[C] [C] [C] [=C] [C] [=C]": 470,
  "[C] [C] [Branch1] [C] [C]": 471,
  "[O] [C] [Branch1] [C] [O]": 472,
  "[C] [S] [C] [=C] [C] [=C]": 473,
  "[C] [O] [C] [=C] [C] [=C]": 474,
  "[C] [C] [C] [Branch1] [C]": 475,
  "[F] [C] [=C] [C] [=C] [C]": 476,
  "[O] [=C] [C] [C] [C] [C]": 477,
  "[O] [=C] [O] [C] [C] [C]": 478,
  "[C] [C] [O] [C] [=C] [C]": 479,
  "[C] [=C] [Ring2] [Ring1]": 480,
  "[C] [C@H1] [Branch1] [C]": 481,
  "[Branch1] [=Branch2] [C]": 482,
  "[=C] [Ring1] [#Branch1]": 483,
  "[=Branch1] [C] [=O] [N]": 484,
  "[S] [=Branch1] [C] [=O]": 485,
  "[O] [=C] [Branch1] [=C]": 486,
  "[=Branch1] [C] [=O] [C]": 487,
  "[=C] [Ring1] [=Branch1]": 488,
  "[C] [=Branch1] [C] [=O]": 489,
  "[=C] [C] [=C] [Branch1]": 490,
  "[=C] [Ring1] [#Branch2]": 491,
  "[C] [C] [C] [C] [C] [C]": 492,
  "[=C] [C] [=C] [Branch2]": 493,
  "[C] [C] [C] [C] [O] [C]": 494,
  "[C] [C] [C] [C] [N] [C]": 495,
  "[C] [O] [C] [C] [N] [C]": 496,
  "[O] [=C] [C] [=Branch2]": 497,
  "[=Branch1] [C] [=O] [O]": 498,
  "[O] [=C] [Branch1] [=N]": 499,
  "[O] [=C] [Branch1] [#C]": 500,
  "[C] [O] [C] [C] [O] [C]": 501,
  "[=C] [Branch1] [C] [Cl]": 502,
  "[=C] [C] [Branch1] [C]": 503,
  "[C] [C] [=C] [Branch2]": 504,
  "[O] [=C] [Branch1] [C]": 505,
  "[=C] [Branch2] [Ring1]": 506,
  "[=O] [C] [=C] [C] [=C]": 507,
  "[Ring1] [#Branch1] [C]": 508,
  "[=C] [C] [=C] [C] [=C]": 509,
  "[=C] [Branch1] [C] [O]": 510,
  "[Ring1] [=Branch1] [N]": 511,
  "[=C] [Branch2] [Ring2]": 512,
  "[Ring1] [=Branch1] [C]": 513,
  "[C] [C] [=C] [Branch1]": 514,
  "[O] [=C] [Branch1] [S]": 515,
  "[O] [=C] [C] [Branch2]": 516,
  "[Br] [C] [=C] [C] [=C]": 517,
  "[O] [=C] [Branch1] [N]": 518,
  "[Cl] [C] [=C] [C] [=C]": 519,
  "[O] [=C] [Branch1] [O]": 520,
  "[O] [=C] [N] [Branch2]": 521,
  "[O] [=C] [Branch1] [P]": 522,
  "[C] [Ring1] [=Branch1]": 523,
  "[O] [=C] [C] [Branch1]": 524,
  "[C] [C] [C] [C] [C@H1]": 525,
  "[O] [C] [=Branch1] [C]": 526,
  "[C] [Branch1] [C] [C]": 527,
  "[C] [Branch1] [C] [O]": 528,
  "[C] [Branch2] [Ring1]": 529,
  "[F] [Branch1] [C] [F]": 530,
  "[C] [=O] [C] [=C] [C]": 531,
  "[Branch1] [C] [C] [C]": 532,
  "[Branch1] [C] [O] [C]": 533,
  "[=O] [C@H1] [Branch1]": 534,
  "[=C] [C] [=C] [Ring1]": 535,
  "[Branch1] [Ring1] [O]": 536,
  "[C] [O] [C] [Branch1]": 537,
  "[Branch1] [C] [F] [F]": 538,
  "[O] [=C] [C] [=C] [C]": 539,
  "[N] [C] [=N] [C] [=C]": 540,
  "[C] [Branch1] [C] [F]": 541,
  "[F] [C] [=C] [C] [=C]": 542,
  "[C] [C] [=C] [N] [=C]": 543,
  "[C] [C] [=N] [C] [=C]": 544,
  "[O] [=C] [C] [C] [=C]": 545,
  "[O] [=C] [O] [C] [=C]": 546,
  "[C] [C] [N] [Branch2]": 547,
  "[N] [C] [=C] [C] [=C]": 548,
  "[Ring1] [Branch1] [C]": 549,
  "[C] [C@@H1] [Branch2]": 550,
  "[O] [C] [=C] [C] [=C]": 551,
  "[C] [C] [C] [Branch1]": 552,
  "[C] [C] [=C] [C] [=C]": 553,
  "[C] [=C] [C] [=C] [C]": 554,
  "[=C] [Ring2] [Ring1]": 555,
  "[O] [=C] [O] [C] [C]": 556,
  "[O] [=C] [N] [C] [C]": 557,
  "[O] [=C] [C] [C] [C]": 558,
  "[Branch1] [=Branch2]": 559,
  "[C] [=O] [N] [C] [C]": 560,
  "[C] [C] [C] [=N] [C]": 561,
  "[C] [O] [C] [=N] [C]": 562,
  "[C] [N] [C] [=N] [C]": 563,
  "[C] [C] [=N] [O] [C]": 564,
  "[C] [C] [C] [C] [=N]": 565,
  "[C] [C] [N] [C] [=C]": 566,
  "[Branch1] [#Branch2]": 567,
  "[C] [C] [C] [=C] [C]": 568,
  "[O] [C] [C] [=C] [C]": 569,
  "[C] [C] [C] [C] [=C]": 570,
  "[C] [N] [C] [=C] [C]": 571,
  "[C] [C@H1] [Branch1]": 572,
  "[C] [O] [C] [=C] [C]": 573,
  "[C] [C@H1] [Branch2]": 574,
  "[C] [S] [C] [=N] [C]": 575,
  "[C] [C] [N] [N] [=C]": 576,
  "[C] [=C] [C] [N] [C]": 577,
  "[C] [C] [C] [O] [C]": 578,
  "[=Branch1] [C] [=O]": 579,
  "[C] [C] [C] [C] [C]": 580,
  "[C] [C] [C] [C] [N]": 581,
  "[N] [C] [C] [C] [C]": 582,
  "[C] [C] [N] [C] [C]": 583,
  "[C] [Ring2] [Ring1]": 584,
  "[O] [C] [C] [C] [C]": 585,
  "[C] [O] [C] [C] [C]": 586,
  "[C] [N] [C] [C] [C]": 587,
  "[C] [C] [C] [Ring1]": 588,
  "[C] [C@@H1] [C] [N]": 589,
  "[C] [C] [C] [N] [C]": 590,
  "[C] [O] [C] [C] [N]": 591,
  "[O] [=C] [NH1] [C]": 592,
  "[O] [C] [=Branch1]": 593,
  "[=C] [Branch1] [C]": 594,
  "[Ring1] [=Branch2]": 595,
  "[=C] [C] [Branch1]": 596,
  "[Ring1] [#Branch2]": 597,
  "[Branch1] [C] [Cl]": 598,
  "[C] [=Branch1] [C]": 599,
  "[O] [=C] [Branch1]": 600,
  "[Ring1] [=Branch1]": 601,
  "[Ring1] [#Branch1]": 602,
  "[O] [=C] [Branch2]": 603,
  "[Branch1] [C] [F]": 604,
  "[Branch2] [Ring1]": 605,
  "[Branch2] [Ring2]": 606,
  "[O] [C] [Branch1]": 607,
  "[C@@H1] [Branch1]": 608,
  "[Ring1] [Branch2]": 609,
  "[C] [N] [Branch2]": 610,
  "[C] [N] [Branch1]": 611,
  "[C] [C] [Branch2]": 612,
  "[=O] [C] [=C] [C]": 613,
  "[N] [#C] [C] [=C]": 614,
  "[O] [=C] [C] [=C]": 615,
  "[C] [=C] [C] [=C]": 616,
  "[C] [Branch1] [C]": 617,
  "[Branch1] [Ring1]": 618,
  "[Ring1] [Branch1]": 619,
  "[C] [=O] [C] [=C]": 620,
  "[Branch1] [C] [O]": 621,
  "[=C] [C] [=C] [C]": 622,
  "[Branch1] [C] [C]": 623,
  "[C] [=C] [Ring2]": 624,
  "[C] [=O] [N] [C]": 625,
  "[C] [=C] [Ring1]": 626,
  "[O] [C] [=C] [C]": 627,
  "[N] [C] [=C] [C]": 628,
  "[O] [=C] [N] [C]": 629,
  "[N] [#C] [C] [C]": 630,
  "[C@H1] [Branch1]": 631,
  "[C] [C@] [C] [C]": 632,
  "[C] [C] [C] [=N]": 633,
  "[=O] [N] [C@@H1]": 634,
  "[C] [=C] [C] [C]": 635,
  "[C] [C] [C] [=C]": 636,
  "[O] [C] [C] [=C]": 637,
  "[C] [C] [=C] [C]": 638,
  "[C] [S] [C] [=N]": 639,
  "[C] [=O] [O] [C]": 640,
  "[C] [=C] [C] [N]": 641,
  "[C] [N] [C] [=C]": 642,
  "[C] [C] [N] [=C]": 643,
  "[O] [=C] [O] [C]": 644,
  "[C] [N] [N] [=C]": 645,
  "[C] [C] [=N] [N]": 646,
  "[C] [C] [=N] [C]": 647,
  "[C] [C] [=C] [N]": 648,
  "[=O] [N] [C] [C]": 649,
  "[O] [=C] [C] [C]": 650,
  "[N] [C] [=N] [C]": 651,
  "[C] [C] [O] [C]": 652,
  "[Ring2] [Ring2]": 653,
  "[C] [C] [S] [C]": 654,
  "[Ring1] [Ring1]": 655,
  "[C] [C] [C@@H1]": 656,
  "[O] [C] [C] [C]": 657,
  "[C] [C] [C] [C]": 658,
  "[C] [C@@H1] [C]": 659,
  "[C] [C] [C] [S]": 660,
  "[C] [C] [C] [N]": 661,
  "[C] [N] [C] [C]": 662,
  "[C] [O] [C] [C]": 663,
  "[C] [C] [N] [C]": 664,
  "[Ring2] [Ring1]": 665,
  "[N] [C] [C] [C]": 666,
  "[Ring1] [O] [C]": 667,
  "[C] [C] [Ring1]": 668,
  "[=Branch2] [C]": 669,
  "[C] [=Branch1]": 670,
  "[C] [C] [C@H1]": 671,
  "[Cl] .[O] [=C]": 672,
  "[#Branch2] [C]": 673,
  "[C] [C@H1] [C]": 674,
  "[O] [=C] [NH1]": 675,
  "[=C] [Branch1]": 676,
  "[=C] [Branch2]": 677,
  "[#Branch1] [C]": 678,
  "[=Branch1] [C]": 679,
  "[C] [/C] [=C]": 680,
  "[=C] [C] [=C]": 681,
  "[C] [Branch1]": 682,
  "[Branch1] [C]": 683,
  "[N] [Branch1]": 684,
  "[O] [Branch2]": 685,
  "[=N] [C] [=C]": 686,
  "[=O] [C] [=C]": 687,
  "[C] [Branch2]": 688,
  "[C] [=O] [O]": 689,
  "[C] [=N] [C]": 690,
  "[=C] [Ring2]": 691,
  "[=O] [N] [C]": 692,
  "[N] [C] [=C]": 693,
  "[C] [C] [=C]": 694,
  "[N] [#C] [C]": 695,
  "[C] [=C] [C]": 696,
  "[O] [=C] [C]": 697,
  "[O] [=C] [N]": 698,
  "[C] [=Ring1]": 699,
  "[C] [#C] [C]": 700,
  "[C] [C] [=N]": 701,
  "[Ring1] [#C]": 702,
  "[Ring1] [=N]": 703,
  "[C] [=O] [N]": 704,
  "[=C] [Ring1]": 705,
  "[C] [=O] [C]": 706,
  "[Ring1] [O]": 707,
  "[Ring1] [C]": 708,
  "[C] [Ring1]": 709,
  "[C] [O] [C]": 710,
  "[C] [Ring2]": 711,
  "[C] [C] [N]": 712,
  "[C] [N] [N]": 713,
  "[N] [C@@H1]": 714,
  "[C] [C] [S]": 715,
  "[C] [C] [C]": 716,
  "[Ring1] [N]": 717,
  "[N] [C] [C]": 718,
  "[Ring1] [P]": 719,
  "[Ring1] [S]": 720,
  "[O] [C] [C]": 721,
  "[C] [N] [C]": 722,
  "[C] [C@@H1]": 723,
  "[C] [S] [C]": 724,
  "[C] [C@H1]": 725,
  "[#Branch2]": 726,
  "[=Branch1]": 727,
  "[#Branch1]": 728,
  "[=Branch2]": 729,
  "[Cl] .[O]": 730,
  "[Branch2]": 731,
  "[Branch1]": 732,
  "[C] [C@@]": 733,
  "[Cl] .[N]": 734,
  "[C] [N+1]": 735,
  "[C] [=N]": 736,
  "[C] [=C]": 737,
  "[N] [=C]": 738,
  "[Br] [C]": 739,
  "[=O] [C]": 740,
  "[=O] [N]": 741,
  "[C] [=O]": 742,
  "[=N] [C]": 743,
  "[=C] [C]": 744,
  "[C] [Cl]": 745,
  "[C] [C@]": 746,
  "[=N] [N]": 747,
  "[=Ring1]": 748,
  "[=O] [O]": 749,
  "[C] [/C]": 750,
  "[=C] [N]": 751,
  "[O] [=C]": 752,
  "[C] [F]": 753,
  "[O] [C]": 754,
  "[C@@H1]": 755,
  "[S] [C]": 756,
  "[N] [N]": 757,
  "[C] [N]": 758,
  "[Ring1]": 759,
  "[Ring2]": 760,
  "[C] [S]": 761,
  "[N] [C]": 762,
  "[F] [C]": 763,
  "[C] [C]": 764,
  "[C@H1]": 765,
  "[=N]": 766,
  "[#C]": 767,
  "[=O]": 768,
  "[Br]": 769,
  "[=C]": 770,
  "[Cl]": 771,
  "[S]": 772,
  "[P]": 773,
  "[N]": 774,
  "[C]": 775,
  "[O]": 776,
  ".[68Ga+3]": 777,
  "[N@]": 778,
  "[124I-1]": 779,
  "[/Br]": 780,
  "[82Rb+1]": 781,
  "[19F]": 782,
  "[I+1]": 783,
  "[=Se+1]": 784,
  ".[H-1]": 785,
  "[SH0]": 786,
  "[/Cl]": 787,
  "[Fe-3]": 788,
  "[F]": 789,
  "[=PH2]": 790,
  "[Ca]": 791,
  "[11C]": 792,
  "[PH2+1]": 793,
  "[=13C]": 794,
  "[Se+1]": 795,
  "[\\Cl]": 796,
  "[Zn+2]": 797,
  "[127Xe]": 798,
  "[Cl+2]": 799,
  "[NH1+1]": 800,
  "[Te]": 801,
  "[SH1]": 802,
  "[#P]": 803,
  "[\\F]": 804,
  "[Mg+2]": 805,
  "[\\C@@H1]": 806,
  "[C@@]": 807,
  "[14C@H1]": 808,
  "[=PH1]": 809,
  ".[B]": 810,
  "[P@+1]": 811,
  ".[Al+3]": 812,
  "[Cs]": 813,
  "[I]": 814,
  ".[Bi+3]": 815,
  "[S@@]": 816,
  ".[O]": 817,
  "[=Al]": 818,
  "[#C-1]": 819,
  "[\\Se]": 820,
  ".[125IH1]": 821,
  "[CH0]": 822,
  ".[Bi]": 823,
  "[NH1]": 824,
  "[131I]": 825,
  "[-/Ring1]": 826,
  "[TeH1]": 827,
  "[76BrH1]": 828,
  "[=P@@]": 829,
  "[SiH1]": 830,
  "[N@+1]": 831,
  "[N-1]": 832,
  "[/I]": 833,
  "[C-1]": 834,
  "[P+1]": 835,
  "[Se]": 836,
  "[18OH1]": 837,
  "[\\PH1]": 838,
  ".[C]": 839,
  "[CH1-1]": 840,
  ".[NH3+1]": 841,
  "[=B-1]": 842,
  "[As-1]": 843,
  "[NH2+1]": 844,
  "[10B]": 845,
  "[P@@]": 846,
  "[\\O-1]": 847,
  "[129Xe]": 848,
  ".[OH1-1]": 849,
  "[#11C]": 850,
  "[Te-1]": 851,
  "[/As]": 852,
  "[125I]": 853,
  "[123I-1]": 854,
  "[BH3-1]": 855,
  ".[F-1]": 856,
  ".[Zn]": 857,
  "[/PH1]": 858,
  "[11C@@H1]": 859,
  "[=O+1]": 860,
  "[Ba]": 861,
  ".[Cl]": 862,
  "[B-1]": 863,
  "[Ag+1]": 864,
  "[211At]": 865,
  "[/Si]": 866,
  "[=18O]": 867,
  "[-\\Ring2]": 868,
  "[Cl-1]": 869,
  "[=Fe]": 870,
  "[123I]": 871,
  ".[3H]": 872,
  "[=Se]": 873,
  "[O+1]": 874,
  "[/125I]": 875,
  "[/C@@]": 876,
  "[11CH3]": 877,
  "[Mg+1]": 878,
  "[Al-3]": 879,
  ".[N]": 880,
  "[B]": 881,
  ".[S-2]": 882,
  ".[F]": 883,
  "[H]": 884,
  "[Ba+2]": 885,
  ".[KH1]": 886,
  "[LiH1]": 887,
  ".[CaH2]": 888,
  "[Ag]": 889,
  ".[I-1]": 890,
  ".[BH0]": 891,
  "[11C-1]": 892,
  "[Cl+1]": 893,
  "[14CH1]": 894,
  "[18FH1]": 895,
  "[/P]": 896,
  "[AsH3]": 897,
  "[/13C]": 898,
  "[/C]": 899,
  "[=Si]": 900,
  "[18F]": 901,
  "[\\123I]": 902,
  "[Kr]": 903,
  ".[Ag]": 904,
  ".[TeH2]": 905,
  "[\\I]": 906,
  "[81Kr]": 907,
  ".[SH1-1]": 908,
  "[N@@+1]": 909,
  "[/S]": 910,
  "[85SrH2]": 911,
  "[AsH1]": 912,
  "[\\N]": 913,
  ".[O-2]": 914,
  ".[18F-1]": 915,
  "[15N]": 916,
  "[PH1]": 917,
  "[Xe]": 918,
  "[Mg]": 919,
  "[\\C@H1]": 920,
  ".[Cl-1]": 921,
  "[=14CH1]": 922,
  "[P@]": 923,
  "[\\C]": 924,
  "[76Br]": 925,
  "[CH2-1]": 926,
  "[\\NH1]": 927,
  "[As+1]": 928,
  ".[MgH2]": 929,
  "[131I-1]": 930,
  ".[Be+2]": 931,
  ".[2H]": 932,
  "[=P]": 933,
  "[/13CH1]": 934,
  "[/14C]": 935,
  "[Ring3]": 936,
  "[=S+1]": 937,
  ".[Sr+2]": 938,
  "[131Cs]": 939,
  "[Ca+2]": 940,
  "[15OH2]": 941,
  "[13CH3]": 942,
  "[#Ring2]": 943,
  "[SeH1]": 944,
  ".[Na+1]": 945,
  "[=S-1]": 946,
  "[35S]": 947,
  "[OH1+1]": 948,
  "[\\S-1]": 949,
  "[14CH2]": 950,
  "[At]": 951,
  "[I+2]": 952,
  "[/-Ring1]": 953,
  "[\\Si]": 954,
  "[223Ra]": 955,
  "[OH1]": 956,
  "[SrH2]": 957,
  "[Br+2]": 958,
  "[\\CH1-1]": 959,
  "[/-Ring2]": 960,
  "[Fe+3]": 961,
  "[Li+1]": 962,
  "[Zn]": 963,
  "[SH1+1]": 964,
  ".[I]": 965,
  "[-\\Ring1]": 966,
  "[/123I]": 967,
  "[#N]": 968,
  "[/131I]": 969,
  "[I-1]": 970,
  "[Cl+3]": 971,
  "[=SH0]": 972,
  "[2H]": 973,
  "[S+1]": 974,
  "[17F]": 975,
  "[=CH1-1]": 976,
  "[/P+1]": 977,
  ".[Rb+1]": 978,
  "[14C]": 979,
  "[=Ring3]": 980,
  "[P@@+1]": 981,
  "[Branch3]": 982,
  "[/O]": 983,
  "[BH0]": 984,
  "[13CH2]": 985,
  "[SeH2]": 986,
  "[=S@@]": 987,
  "[SH2]": 988,
  "[NH1-1]": 989,
  "[-/Ring2]": 990,
  ".[H+1]": 991,
  "[Se-1]": 992,
  "[=P@]": 993,
  "[14C@@]": 994,
  "[73Se]": 995,
  ".[As]": 996,
  "[K+1]": 997,
  "[/Se]": 998,
  ".[C-1]": 999,
  "[=32PH1]": 1000,
  "[11CH1]": 1001,
  "[123Te]": 1002,
  "[Na+1]": 1003,
  "[Si]": 1004,
  "[/N+1]": 1005,
  ".[Br]": 1006,
  "[He]": 1007,
  "[SiH2]": 1008,
  "[BH2-1]": 1009,
  "[/SeH1]": 1010,
  "[/S@@]": 1011,
  "[#O+1]": 1012,
  "[/N-1]": 1013,
  "[127I]": 1014,
  "[42K+1]": 1015,
  "[=32P]": 1016,
  "[/S+1]": 1017,
  ".[N-1]": 1018,
  "[Fe-4]": 1019,
  "[=Te+1]": 1020,
  "[11CH2]": 1021,
  "[82Rb]": 1022,
  "[S@]": 1023,
  "[S@@+1]": 1024,
  "[=Te]": 1025,
  "[=SH1]": 1026,
  "[=N-1]": 1027,
  "[/N]": 1028,
  ".[NH1-1]": 1029,
  "[Fe+1]": 1030,
  ".[Ba+2]": 1031,
  "[135I]": 1032,
  "[\\B]": 1033,
  "[Si-1]": 1034,
  "[N+3]": 1035,
  "[45Ca+2]": 1036,
  ".[Zn+1]": 1037,
  "[BH1-1]": 1038,
  "[Si@]": 1039,
  "[#N+1]": 1040,
  "[#14C]": 1041,
  "[14CH3]": 1042,
  "[=As]": 1043,
  "[13NH3]": 1044,
  "[=11C]": 1045,
  ".[Ca+2]": 1046,
  "[=OH1+1]": 1047,
  ".[85Sr+2]": 1048,
  "[/S@]": 1049,
  "[/C@]": 1050,
  "[125IH1]": 1051,
  "[SH1-1]": 1052,
  "[SiH1-1]": 1053,
  "[Fe]": 1054,
  "[O-2]": 1055,
  ".[NH2+1]": 1056,
  "[=13CH1]": 1057,
  "[B@@-1]": 1058,
  "[\\Br]": 1059,
  "[Br-1]": 1060,
  "[89Sr+2]": 1061,
  "[B@-1]": 1062,
  "[13C]": 1063,
  ".[HH1]": 1064,
  "[FeH2-2]": 1065,
  ".[Se-2]": 1066,
  "[\\P]": 1067,
  "[/F]": 1068,
  "[18F-1]": 1069,
  "[\\SeH1]": 1070,
  "[15NH1]": 1071,
  "[CH1+1]": 1072,
  ".[K+1]": 1073,
  "[Ra]": 1074,
  "[/C@H1]": 1075,
  "[MgH2]": 1076,
  "[O-1]": 1077,
  ".[Li]": 1078,
  "[\\N+1]": 1079,
  "[\\S+1]": 1080,
  "[OH0]": 1081,
  ".[LiH1]": 1082,
  ".[O-1]": 1083,
  "[\\S]": 1084,
  "[22Na+1]": 1085,
  "[124I]": 1086,
  "[/B]": 1087,
  "[123IH1]": 1088,
  "[\\C@@]": 1089,
  ".[Ag+1]": 1090,
  "[\\N-1]": 1091,
  "[/O-1]": 1092,
  "[\\C-1]": 1093,
  ".[S]": 1094,
  ".[Li+1]": 1095,
  ".[S-1]": 1096,
  ".[NaH1]": 1097,
  "[133Xe]": 1098,
  "[Zn-2]": 1099,
  ".[NH4+1]": 1100,
  "[32P]": 1101,
  "[NH3+1]": 1102,
  "[\\-Ring2]": 1103,
  ".[Br-1]": 1104,
  "[NH2+2]": 1105,
  "[N+1]": 1106,
  "[=S@]": 1107,
  "[I+3]": 1108,
  "[=Branch3]": 1109,
  ".[SiH4]": 1110,
  "[13CH1]": 1111,
  "[75Se]": 1112,
  "[C@]": 1113,
  "[3H]": 1114,
  "[Al]": 1115,
  "[Rb]": 1116,
  "[N@@]": 1117,
  "[Fe+2]": 1118,
  "[85Sr+2]": 1119,
  "[=S]": 1120,
  "[Se-2]": 1121,
  "[/P@@]": 1122,
  ".[SiH3-1]": 1123,
  "[=NH2+1]": 1124,
  "[47Ca+2]": 1125,
  "[/S-1]": 1126,
  "[F-1]": 1127,
  "[=N+1]": 1128,
  "[NH0]": 1129,
  "[\\C@]": 1130,
  "[/C-1]": 1131,
  "[OH2+1]": 1132,
  ".[Cs+1]": 1133,
  ".[Mg+2]": 1134,
  "[\\-Ring1]": 1135,
  "[=14C]": 1136,
  "[#S]": 1137,
  "[C+1]": 1138,
  "[=NH1+1]": 1139,
  "[\\NH1-1]": 1140,
  "[S@+1]": 1141,
  "[=Ring2]": 1142,
  ".[Zn+2]": 1143,
  "[N@H1+1]": 1144,
  "[K]": 1145,
  ".[K]": 1146,
  "[=Mg]": 1147,
  "[\\11CH3]": 1148,
  "[As]": 1149,
  "[\\O]": 1150,
  ".[OH3+1]": 1151,
  "[Na]": 1152,
  "[=B]": 1153,
  "[CH1]": 1154,
  "[=SeH1]": 1155,
  "[125I-1]": 1156,
  "[/NH1]": 1157,
  "[\\125I]": 1158,
  "[\\3H]": 1159,
  "[S-1]": 1160,
  "[/C@@H1]": 1161
}