{
  "<s>": 0,
  "</s>": 1,
  "<pad>": 2,
  "<unk>": 3,
  "<mask>": 4,
  "[C] [C] [C@H1] [Branch1] [C] [C] [C@H1] [Branch2]": 5,
  "[C] [S] [=Branch1] [C] [=O] [=Branch1] [C] [=O]": 6,
  "[C] [C] [Branch1] [C] [C] [C] [C@H1] [Branch2]": 7,
  "[C] [O] [C] [=C] [C] [=C] [Branch2] [Branch1]": 8,
  "[O] [=C] [Branch2] [Ring1] [#Branch1] [N] [C]": 9,
  "[O] [=C] [Branch1] [C] [O] [C] [Branch1] [C]": 10,
  "[O] [=C] [Branch2] [Ring1] [Branch1] [N] [C]": 11,
  "[C] [O] [C] [=C] [C] [=C] [Branch2] [Ring2]": 12,
  "[C] [C] [Branch1] [C] [C] [Branch1] [C] [C]": 13,
  "[C] [O] [C] [=C] [C] [=C] [Branch2] [Ring1]": 14,
  "[O] [=C] [Branch1] [Ring2] [O] [C] [C] [C]": 15,
  "[O] [=C] [Branch2] [Ring1] [Ring2] [N] [C]": 16,
  "[C] [C] [Branch1] [C] [C] [C@H1] [Branch2]": 17,
  "[O] [=C] [Branch1] [Ring1] [O] [C] [C] [C]": 18,
  "[O] [=C] [Branch2] [Ring1] [Ring1] [N] [C]": 19,
  "[C] [C] [N] [Branch1] [Ring1] [C] [C] [C]": 20,
  "[O] [=C] [Branch1] [#Branch2] [N] [C] [C]": 21,
  "[O] [=C] [Branch1] [C] [O] [C] [Branch2]": 22,
  "[N] [#C] [C] [=C] [C] [=C] [C] [Branch2]": 23,
  "[C] [=C] [C] [=Branch1] [C] [=O] [N] [C]": 24,
  "[C] [O] [C] [=Branch1] [C] [=O] [C] [=C]": 25,
  "[C] [N] [C] [=Branch1] [C] [=O] [C] [=C]": 26,
  "[C] [O] [C] [=Branch1] [C] [=O] [C] [C]": 27,
  "[C] [C] [O] [C] [=C] [C] [=C] [Branch2]": 28,
  "[C] [O] [C] [=Branch1] [C] [=O] [N] [C]": 29,
  "[C] [C] [=C] [C] [=C] [Branch2] [Ring2]": 30,
  "[C] [C] [=Branch1] [C] [=O] [N] [C] [C]": 31,
  "[C] [C] [C] [=Branch1] [C] [=O] [N] [C]": 32,
  "[C] [C] [=C] [C] [=C] [Branch2] [Ring1]": 33,
  "[C] [C] [O] [C] [=Branch1] [C] [=O] [C]": 34,
  "[C] [O] [C] [=C] [C] [=C] [Branch1] [C]": 35,
  "[O] [=C] [Branch1] [C] [O] [C] [=C] [C]": 36,
  "[C] [C] [=C] [C] [Branch1] [C] [C] [=C]": 37,
  "[C] [C] [C@H1] [Branch1] [C] [C] [C@H1]": 38,
  "[C] [O] [C] [=C] [C] [=C] [C] [Branch2]": 39,
  "[C] [O] [C] [=Branch1] [C] [=O] [C@@H1]": 40,
  "[C] [O] [C] [=C] [C] [Branch2] [Ring2]": 41,
  "[O] [=C] [Branch1] [Ring1] [O] [C] [C]": 42,
  "[O] [=C] [Branch2] [Ring1] [C] [N] [C]": 43,
  "[O] [=C] [Branch2] [Ring1] [Ring1] [C]": 44,
  "[O] [=C] [Branch1] [C] [O] [C] [C] [C]": 45,
  "[O] [=S] [=Branch1] [C] [=O] [Branch1]": 46,
  "[O] [=C] [Branch2] [Ring1] [N] [N] [C]": 47,
  "[O] [=S] [=Branch1] [C] [=O] [Branch2]": 48,
  "[C] [O] [C] [=C] [C] [Branch2] [Ring1]": 49,
  "[C] [C] [Branch1] [C] [C] [=C] [C] [C]": 50,
  "[O] [=C] [Branch1] [C] [O] [C] [O] [C]": 51,
  "[O] [=C] [Branch1] [#Branch2] [N] [C]": 52,
  "[O] [=C] [Branch2] [Ring2] [#Branch1]": 53,
  "[C] [N] [Branch1] [C] [C] [C] [C] [C]": 54,
  "[O] [=C] [Branch2] [Ring2] [=Branch1]": 55,
  "[O] [=C] [Branch2] [Ring1] [=Branch1]": 56,
  "[O] [=C] [Branch2] [Ring2] [#Branch2]": 57,
  "[O] [=C] [Branch2] [Ring2] [=Branch2]": 58,
  "[O] [=C] [Branch2] [Ring1] [#Branch2]": 59,
  "[O] [=C] [Branch2] [Ring1] [=Branch2]": 60,
  "[O] [=C] [Branch2] [Ring1] [#Branch1]": 61,
  "[C] [C] [Branch1] [C] [C] [C] [C@@H1]": 62,
  "[O] [=C] [Branch1] [#Branch1] [N] [C]": 63,
  "[N] [#C] [C] [=C] [C] [=C] [Branch2]": 64,
  "[C] [C] [=C] [C] [=Branch1] [C] [=O]": 65,
  "[O] [=C] [Branch2] [Ring1] [Branch2]": 66,
  "[O] [=C] [Branch2] [Ring2] [Branch2]": 67,
  "[C] [C] [Branch1] [C] [C] [C] [C@H1]": 68,
  "[O] [=C] [Branch2] [Ring1] [Branch1]": 69,
  "[O] [=C] [Branch2] [Ring2] [Branch1]": 70,
  "[C] [=C] [C] [=Branch1] [C] [=O] [O]": 71,
  "[C] [C] [=Branch1] [C] [=O] [C] [=C]": 72,
  "[C] [O] [C] [=Branch1] [C] [=O] [N]": 73,
  "[C] [C] [C] [C] [=Branch1] [C] [=O]": 74,
  "[C] [C] [O] [C] [=Branch1] [C] [=O]": 75,
  "[C] [C] [Branch1] [C] [C] [Branch2]": 76,
  "[C] [C] [C] [=C] [C] [=C] [Branch2]": 77,
  "[C] [C] [=Branch1] [C] [=O] [N] [C]": 78,
  "[C] [O] [C] [=C] [C] [=C] [Branch2]": 79,
  "[C] [C] [=Branch1] [C] [=O] [O] [C]": 80,
  "[C] [O] [C] [=Branch1] [C] [=O] [C]": 81,
  "[C] [N] [C] [=Branch1] [C] [=O] [C]": 82,
  "[C] [O] [C] [=C] [C] [=C] [Branch1]": 83,
  "[C] [C] [=C] [C] [=C] [Branch1] [C]": 84,
  "[O] [=C] [Branch1] [C] [O] [C] [=C]": 85,
  "[O] [=C] [Branch1] [#C] [N] [C] [C]": 86,
  "[O] [=C] [O] [C] [=C] [C] [Branch1]": 87,
  "[C] [C] [=C] [C] [=C] [C] [Branch2]": 88,
  "[C] [N] [C] [=Branch1] [C] [=O] [N]": 89,
  "[C] [C] [N] [C] [=Branch1] [C] [=O]": 90,
  "[O] [=C] [Branch2] [Ring1] [Ring1]": 91,
  "[O] [=C] [Branch1] [C] [O] [C] [C]": 92,
  "[O] [=C] [Branch1] [N] [N] [C] [C]": 93,
  "[C] [O] [C] [=C] [C] [=C] [C] [=C]": 94,
  "[C] [O] [C] [=C] [C] [=C] [N] [=C]": 95,
  "[O] [=C] [Branch2] [Ring2] [Ring2]": 96,
  "[O] [=C] [Branch1] [O] [N] [C] [C]": 97,
  "[O] [=C] [Branch2] [Ring2] [Ring1]": 98,
  "[O] [=C] [Branch2] [Ring1] [C] [C]": 99,
  "[O] [=C] [Branch2] [Ring1] [Ring2]": 100,
  "[O] [=C] [C] [C] [Branch1] [C] [O]": 101,
  "[O] [=C] [O] [C] [=C] [C] [=C] [C]": 102,
  "[C] [O] [C] [=C] [C] [Branch1] [C]": 103,
  "[C] [C] [Branch1] [C] [C] [C] [C]": 104,
  "[C] [C] [Branch1] [C] [C] [N] [C]": 105,
  "[O] [=C] [Branch1] [=Branch2] [C]": 106,
  "[C] [C] [Branch1] [C] [C] [C@@H1]": 107,
  "[C] [C] [Branch1] [C] [C] [C] [N]": 108,
  "[C] [N] [Branch1] [C] [C] [C] [C]": 109,
  "[C] [C] [N] [C] [C] [N] [Branch2]": 110,
  "[C] [C] [Branch1] [C] [C] [O] [C]": 111,
  "[C] [C] [O] [C] [=C] [C] [=C] [C]": 112,
  "[C] [C] [C] [O] [C] [=C] [C] [=C]": 113,
  "[C] [=C] [C] [=Branch1] [C] [=O]": 114,
  "[O] [=C] [C] [=C] [C] [=Branch2]": 115,
  "[C] [C] [C@H1] [Branch1] [C] [C]": 116,
  "[C] [C] [Branch1] [C] [C] [C@H1]": 117,
  "[Cl] [C] [=C] [C] [=C] [Branch2]": 118,
  "[O] [=C] [C] [=Branch1] [C] [=O]": 119,
  "[O] [=C] [Branch1] [=N] [N] [C]": 120,
  "[O] [=C] [Branch2] [Ring1] [=N]": 121,
  "[C] [C] [C] [C] [C] [C] [C] [C]": 122,
  "[O] [=C] [Branch1] [#C] [N] [C]": 123,
  "[O] [=C] [O] [C] [=C] [Branch2]": 124,
  "[C] [C] [=C] [C] [=C] [Branch2]": 125,
  "[O] [C] [=C] [C] [=C] [Branch1]": 126,
  "[C] [C] [C] [=Branch1] [C] [=O]": 127,
  "[N] [C] [=Branch1] [C] [=O] [C]": 128,
  "[C] [C] [=Branch1] [C] [=O] [O]": 129,
  "[O] [=C] [Branch2] [Ring1] [=C]": 130,
  "[C] [O] [C] [=Branch1] [C] [=O]": 131,
  "[O] [=C] [C] [=C] [C] [Branch2]": 132,
  "[C] [C] [=C] [C] [=C] [Branch1]": 133,
  "[O] [=C] [Branch1] [=C] [N] [C]": 134,
  "[O] [C] [=C] [C] [=C] [Branch2]": 135,
  "[F] [C] [=C] [C] [=C] [Branch2]": 136,
  "[O] [=C] [Branch2] [Ring1] [#C]": 137,
  "[C] [C] [=Branch1] [C] [=O] [N]": 138,
  "[C] [N] [C] [=Branch1] [C] [=O]": 139,
  "[O] [=C] [Branch2] [Ring2] [=N]": 140,
  "[O] [=C] [C] [=C] [C] [Branch1]": 141,
  "[O] [=C] [Branch2] [Ring1] [S]": 142,
  "[O] [=C] [O] [C] [=C] [C] [=C]": 143,
  "[C] [O] [C] [=C] [C] [Branch2]": 144,
  "[C] [O] [C] [=C] [Branch1] [C]": 145,
  "[O] [=C] [Branch2] [Ring2] [C]": 146,
  "[O] [=C] [O] [C] [C] [Branch1]": 147,
  "[O] [=C] [Branch1] [C] [N] [C]": 148,
  "[O] [=C] [N] [C] [=C] [C] [=C]": 149,
  "[O] [=C] [Branch2] [Ring1] [O]": 150,
  "[O] [=C] [Branch1] [C] [O] [C]": 151,
  "[C] [O] [C] [=C] [C] [Branch1]": 152,
  "[O] [=C] [Branch2] [Ring1] [N]": 153,
  "[O] [=C] [Branch2] [Ring1] [P]": 154,
  "[O] [=C] [Branch1] [S] [N] [C]": 155,
  "[O] [=C] [Branch2] [Ring2] [O]": 156,
  "[C] [C] [=C] [C] [Branch1] [C]": 157,
  "[O] [=C] [O] [C] [Branch1] [C]": 158,
  "[O] [=C] [C] [C] [=C] [C] [=C]": 159,
  "[N] [#C] [C] [=C] [C] [=C] [C]": 160,
  "[O] [=C] [Branch2] [Ring2] [N]": 161,
  "[O] [=C] [Branch1] [P] [N] [C]": 162,
  "[O] [=C] [Branch2] [Ring1] [C]": 163,
  "[C] [O] [C] [=C] [C] [=N] [C]": 164,
  "[O] [C] [C] [O] [C] [Branch2]": 165,
  "[O] [=C] [Branch1] [#Branch1]": 166,
  "[O] [=C] [Branch2] [=Branch1]": 167,
  "[C] [C] [C] [C] [N] [Branch2]": 168,
  "[C] [C] [O] [C] [=C] [C] [=C]": 169,
  "[C] [C] [Branch1] [C] [C] [N]": 170,
  "[C] [C] [Branch1] [C] [C] [C]": 171,
  "[C] [N] [C] [C] [C] [Branch2]": 172,
  "[C] [O] [C] [=C] [C] [=C] [C]": 173,
  "[C] [C] [C] [C] [=C] [C] [=C]": 174,
  "[C] [C] [C] [=C] [C] [=C] [C]": 175,
  "[C] [C] [C] [Branch1] [C] [C]": 176,
  "[O] [=C] [Branch1] [#Branch2]": 177,
  "[C] [N] [C] [C] [N] [Branch2]": 178,
  "[C] [N] [Branch1] [C] [C] [C]": 179,
  "[O] [=C] [Branch1] [=Branch2]": 180,
  "[O] [=C] [C] [C] [C] [=C] [C]": 181,
  "[C] [C] [C] [C] [C] [=N] [C]": 182,
  "[O] [=C] [Branch1] [Branch2]": 183,
  "[O] [=C] [Branch2] [Branch1]": 184,
  "[O] [=S] [=Branch1] [C] [=O]": 185,
  "[O] [=C] [Branch1] [#C] [C]": 186,
  "[C] [=C] [C] [=C] [Branch2]": 187,
  "[O] [=C] [Branch1] [=N] [C]": 188,
  "[O] [=C] [C] [=C] [Branch2]": 189,
  "[C] [C] [=Branch1] [C] [=O]": 190,
  "[O] [=C] [Branch1] [=C] [C]": 191,
  "[N] [C] [=Branch1] [C] [=O]": 192,
  "[O] [=C] [C] [=C] [Branch1]": 193,
  "[O] [=C] [C] [Branch1] [C]": 194,
  "[C] [=C] [Branch1] [C] [C]": 195,
  "[C] [C] [=C] [Branch1] [C]": 196,
  "[C] [C] [=N] [C] [Branch2]": 197,
  "[O] [=C] [Branch1] [Ring1]": 198,
  "[O] [=C] [C] [=C] [C] [=C]": 199,
  "[O] [=C] [O] [C] [Branch1]": 200,
  "[O] [=C] [O] [C] [Branch2]": 201,
  "[O] [=C] [Branch1] [O] [C]": 202,
  "[C] [C] [C] [=C] [Branch2]": 203,
  "[O] [=C] [Branch1] [S] [C]": 204,
  "[C] [C] [=C] [C] [Branch2]": 205,
  "[Cl] [C] [=C] [C] [=C] [C]": 206,
  "[C] [C] [=C] [N] [Branch2]": 207,
  "[C] [N] [C] [=C] [Branch2]": 208,
  "[C] [C] [=N] [N] [Branch1]": 209,
  "[C] [C] [=C] [C] [Branch1]": 210,
  "[N] [#C] [C] [=C] [C] [=C]": 211,
  "[O] [=C] [Branch2] [Ring2]": 212,
  "[N] [=C] [Branch1] [C] [N]": 213,
  "[O] [=C] [Branch1] [P] [C]": 214,
  "[C] [S] [C] [=C] [C] [=C]": 215,
  "[O] [=C] [O] [C] [C] [=C]": 216,
  "[C] [O] [C] [=N] [C] [=C]": 217,
  "[C] [C] [C] [=C] [C] [=C]": 218,
  "[C] [C] [=C] [C] [=C] [C]": 219,
  "[F] [C] [=C] [C] [=C] [C]": 220,
  "[O] [C] [C] [Branch1] [C]": 221,
  "[C] [N] [C] [=C] [C] [=C]": 222,
  "[C] [C] [Branch1] [C] [C]": 223,
  "[N] [C] [=C] [C] [=C] [C]": 224,
  "[O] [=C] [O] [C] [=C] [C]": 225,
  "[C] [O] [C] [=C] [C] [=C]": 226,
  "[O] [C] [=C] [C] [=C] [C]": 227,
  "[O] [=C] [C] [C] [C] [C]": 228,
  "[O] [=C] [O] [C] [C] [C]": 229,
  "[C] [C@H1] [Branch1] [C]": 230,
  "[C] [C] [O] [C] [=C] [C]": 231,
  "[C] [O] [C] [C] [N] [C]": 232,
  "[C] [C] [C] [C] [O] [C]": 233,
  "[O] [=C] [Branch1] [#C]": 234,
  "[O] [=C] [Branch1] [=N]": 235,
  "[C] [O] [C] [C] [O] [C]": 236,
  "[C] [C] [C] [C] [N] [C]": 237,
  "[O] [=C] [Branch1] [=C]": 238,
  "[O] [=C] [C] [=Branch2]": 239,
  "[C] [C] [C] [C] [C] [C]": 240,
  "[O] [=C] [Branch1] [O]": 241,
  "[C] [C] [=C] [Branch1]": 242,
  "[O] [=C] [Branch1] [P]": 243,
  "[O] [=C] [N] [Branch2]": 244,
  "[O] [=C] [C] [Branch1]": 245,
  "[C] [C] [=C] [Branch2]": 246,
  "[Cl] [C] [=C] [C] [=C]": 247,
  "[O] [=C] [C] [Branch2]": 248,
  "[O] [=C] [Branch1] [N]": 249,
  "[O] [=C] [Branch1] [S]": 250,
  "[C] [C] [C] [C] [C@H1]": 251,
  "[Br] [C] [=C] [C] [=C]": 252,
  "[C] [C@@H1] [Branch2]": 253,
  "[N] [C] [=N] [C] [=C]": 254,
  "[O] [=C] [O] [C] [=C]": 255,
  "[F] [C] [=C] [C] [=C]": 256,
  "[C] [=C] [C] [=C] [C]": 257,
  "[N] [C] [=C] [C] [=C]": 258,
  "[O] [=C] [C] [=C] [C]": 259,
  "[O] [C] [=C] [C] [=C]": 260,
  "[C] [C] [=N] [C] [=C]": 261,
  "[C] [C] [=C] [N] [=C]": 262,
  "[C] [C] [=C] [C] [=C]": 263,
  "[C] [C] [C] [Branch1]": 264,
  "[C] [C] [N] [Branch2]": 265,
  "[O] [=C] [N] [C] [C]": 266,
  "[C] [S] [C] [=N] [C]": 267,
  "[C] [N] [C] [=C] [C]": 268,
  "[O] [=C] [C] [C] [C]": 269,
  "[O] [=C] [O] [C] [C]": 270,
  "[C] [=C] [C] [N] [C]": 271,
  "[C] [C] [C] [C] [=N]": 272,
  "[C] [O] [C] [=C] [C]": 273,
  "[C] [C] [N] [N] [=C]": 274,
  "[C] [C] [N] [C] [=C]": 275,
  "[C] [C] [C] [=C] [C]": 276,
  "[C] [C] [C] [=N] [C]": 277,
  "[C] [C] [=N] [O] [C]": 278,
  "[C] [C@H1] [Branch2]": 279,
  "[O] [C] [C] [=C] [C]": 280,
  "[C] [C] [C] [C] [=C]": 281,
  "[C] [O] [C] [=N] [C]": 282,
  "[C] [C@H1] [Branch1]": 283,
  "[C] [N] [C] [=N] [C]": 284,
  "[C] [C] [C] [C] [N]": 285,
  "[C] [C] [C] [N] [C]": 286,
  "[C] [N] [C] [C] [C]": 287,
  "[C] [C] [N] [C] [C]": 288,
  "[N] [C] [C] [C] [C]": 289,
  "[O] [C] [C] [C] [C]": 290,
  "[C] [C] [C] [O] [C]": 291,
  "[C] [O] [C] [C] [C]": 292,
  "[C] [C] [C] [C] [C]": 293,
  "[C] [C@@H1] [C] [N]": 294,
  "[O] [=C] [Branch2]": 295,
  "[O] [=C] [Branch1]": 296,
  "[O] [=C] [NH1] [C]": 297,
  "[C] [=C] [C] [=C]": 298,
  "[N] [#C] [C] [=C]": 299,
  "[O] [C] [Branch1]": 300,
  "[C] [N] [Branch1]": 301,
  "[C] [N] [Branch2]": 302,
  "[C] [C] [Branch2]": 303,
  "[O] [=C] [C] [=C]": 304,
  "[O] [C] [C] [=C]": 305,
  "[C] [C] [=C] [C]": 306,
  "[C] [N] [C] [=C]": 307,
  "[C] [S] [C] [=N]": 308,
  "[C] [C@] [C] [C]": 309,
  "[O] [=C] [N] [C]": 310,
  "[O] [=C] [C] [C]": 311,
  "[C] [N] [N] [=C]": 312,
  "[N] [C] [=N] [C]": 313,
  "[C] [C] [N] [=C]": 314,
  "[C] [C] [C] [=C]": 315,
  "[N] [#C] [C] [C]": 316,
  "[C] [=C] [C] [C]": 317,
  "[O] [=C] [O] [C]": 318,
  "[C] [C] [=N] [N]": 319,
  "[C] [C] [C] [=N]": 320,
  "[C] [C] [=N] [C]": 321,
  "[C] [C] [=C] [N]": 322,
  "[C] [C] [S] [C]": 323,
  "[C] [N] [C] [C]": 324,
  "[C] [C] [C] [C]": 325,
  "[C] [C@@H1] [C]": 326,
  "[C] [O] [C] [C]": 327,
  "[C] [C] [C] [S]": 328,
  "[N] [C] [C] [C]": 329,
  "[O] [C] [C] [C]": 330,
  "[C] [C] [C] [N]": 331,
  "[C] [C] [N] [C]": 332,
  "[C] [C] [O] [C]": 333,
  "[C] [C] [C@@H1]": 334,
  "[Cl] .[O] [=C]": 335,
  "[C] [C] [C@H1]": 336,
  "[C] [C@H1] [C]": 337,
  "[C] [/C] [=C]": 338,
  "[O] [Branch2]": 339,
  "[C] [#C] [C]": 340,
  "[C] [C] [=C]": 341,
  "[C] [=C] [C]": 342,
  "[C] [C] [=N]": 343,
  "[O] [=C] [C]": 344,
  "[O] [=C] [N]": 345,
  "[N] [#C] [C]": 346,
  "[O] [C] [C]": 347,
  "[C] [C] [N]": 348,
  "[C] [C] [S]": 349,
  "[C] [O] [C]": 350,
  "[N] [C] [C]": 351,
  "[N] [C@@H1]": 352,
  "[C] [S] [C]": 353,
  "[C] [C@@H1]": 354,
  "[C] [C] [C]": 355,
  "[C] [N] [C]": 356,
  "[C] [C@H1]": 357,
  "[Cl] .[O]": 358,
  "[Cl] .[N]": 359,
  "[C] [C@@]": 360,
  "[C] [N+1]": 361,
  "[C] [C@]": 362,
  "[C] [=C]": 363,
  "[Br] [C]": 364,
  "[C] [/C]": 365,
  "[N] [=C]": 366,
  "[O] [=C]": 367,
  "[C] [N]": 368,
  "[C] [C]": 369,
  "[F] [C]": 370,
  "[N] [N]": 371,
  "[C] [S]": 372,
  "[O] [C]": 373,
  "[N] [C]": 374,
  "[Br]": 375,
  "[Cl]": 376,
  "[O]": 377,
  "[N]": 378,
  "[C]": 379,
  "[S]": 380,
  "[/14C]": 381,
  "[76BrH1]": 382,
  "[=S@@]": 383,
  "[=Si]": 384,
  "[\\C-1]": 385,
  "[CH1-1]": 386,
  "[Na]": 387,
  ".[CaH2]": 388,
  "[/13CH1]": 389,
  "[\\I]": 390,
  "[P@@+1]": 391,
  "[SrH2]": 392,
  "[Ring2]": 393,
  "[/13C]": 394,
  "[\\3H]": 395,
  "[\\NH1]": 396,
  "[=S]": 397,
  "[\\-Ring2]": 398,
  "[Mg+2]": 399,
  "[=S+1]": 400,
  "[-/Ring2]": 401,
  "[=Branch1]": 402,
  "[=PH2]": 403,
  "[=14CH1]": 404,
  "[=OH1+1]": 405,
  "[At]": 406,
  ".[F]": 407,
  "[13CH1]": 408,
  "[\\S-1]": 409,
  ".[H+1]": 410,
  "[131Cs]": 411,
  "[PH2+1]": 412,
  "[42K+1]": 413,
  ".[Br]": 414,
  ".[S-1]": 415,
  ".[I]": 416,
  "[B@-1]": 417,
  "[223Ra]": 418,
  ".[3H]": 419,
  "[=SH0]": 420,
  "[\\P]": 421,
  ".[OH1-1]": 422,
  ".[Cl-1]": 423,
  "[Branch2]": 424,
  "[11C-1]": 425,
  "[Al-3]": 426,
  "[/O]": 427,
  "[\\Se]": 428,
  "[C@H1]": 429,
  "[Fe+3]": 430,
  "[=N]": 431,
  "[#Branch1]": 432,
  "[82Rb]": 433,
  "[85Sr+2]": 434,
  "[3H]": 435,
  ".[LiH1]": 436,
  "[=Al]": 437,
  "[AsH1]": 438,
  "[/C@@]": 439,
  "[125I]": 440,
  "[Ca]": 441,
  "[As]": 442,
  "[/S-1]": 443,
  "[13NH3]": 444,
  "[C+1]": 445,
  "[SH2]": 446,
  "[Fe+2]": 447,
  "[131I]": 448,
  "[45Ca+2]": 449,
  "[Na+1]": 450,
  "[=B-1]": 451,
  "[/As]": 452,
  "[/N+1]": 453,
  "[BH3-1]": 454,
  "[=P]": 455,
  "[Br-1]": 456,
  "[124I-1]": 457,
  "[76Br]": 458,
  "[\\125I]": 459,
  "[13C]": 460,
  "[As-1]": 461,
  "[=18O]": 462,
  ".[OH3+1]": 463,
  "[F]": 464,
  "[13CH3]": 465,
  ".[NH3+1]": 466,
  "[15OH2]": 467,
  "[P+1]": 468,
  "[Br+2]": 469,
  "[S-1]": 470,
  "[14CH2]": 471,
  "[11CH1]": 472,
  "[SiH1]": 473,
  "[N@]": 474,
  ".[N-1]": 475,
  ".[Li+1]": 476,
  "[N-1]": 477,
  "[NH0]": 478,
  "[Branch3]": 479,
  ".[Se-2]": 480,
  "[=Ring1]": 481,
  ".[O-2]": 482,
  ".[NaH1]": 483,
  "[\\CH1-1]": 484,
  "[/S@@]": 485,
  ".[18F-1]": 486,
  "[P@]": 487,
  ".[SH1-1]": 488,
  ".[TeH2]": 489,
  "[#N+1]": 490,
  "[127Xe]": 491,
  "[/C-1]": 492,
  "[I+2]": 493,
  ".[Zn+1]": 494,
  "[O-1]": 495,
  "[N@+1]": 496,
  "[=Ring3]": 497,
  "[85SrH2]": 498,
  "[N+3]": 499,
  "[=SH1]": 500,
  "[N@@]": 501,
  "[Xe]": 502,
  "[18OH1]": 503,
  "[/P]": 504,
  "[=Ring2]": 505,
  "[=Te+1]": 506,
  "[#Ring2]": 507,
  "[/C@@H1]": 508,
  "[\\NH1-1]": 509,
  "[OH1+1]": 510,
  "[18F-1]": 511,
  "[#N]": 512,
  ".[Ba+2]": 513,
  "[I+3]": 514,
  "[O-2]": 515,
  "[N+1]": 516,
  "[#C-1]": 517,
  "[CH1]": 518,
  "[S+1]": 519,
  "[=O+1]": 520,
  "[\\Cl]": 521,
  "[Fe-3]": 522,
  "[Te]": 523,
  "[B-1]": 524,
  ".[KH1]": 525,
  ".[O]": 526,
  ".[F-1]": 527,
  "[\\B]": 528,
  "[=NH2+1]": 529,
  "[SH0]": 530,
  ".[Na+1]": 531,
  ".[Bi]": 532,
  ".[Ca+2]": 533,
  "[11CH2]": 534,
  "[BH2-1]": 535,
  "[NH2+1]": 536,
  "[#11C]": 537,
  "[17F]": 538,
  "[\\C@]": 539,
  "[Fe+1]": 540,
  "[CH1+1]": 541,
  "[S@@]": 542,
  "[NH2+2]": 543,
  "[/125I]": 544,
  "[/I]": 545,
  "[SH1+1]": 546,
  "[=Branch2]": 547,
  "[Se]": 548,
  "[SiH1-1]": 549,
  "[\\N-1]": 550,
  "[I-1]": 551,
  ".[Mg+2]": 552,
  "[Li+1]": 553,
  "[/S+1]": 554,
  "[=13C]": 555,
  ".[S-2]": 556,
  "[AsH3]": 557,
  "[/131I]": 558,
  ".[Sr+2]": 559,
  "[Ba]": 560,
  "[I+1]": 561,
  "[=Mg]": 562,
  "[Kr]": 563,
  "[\\-Ring1]": 564,
  ".[B]": 565,
  "[/NH1]": 566,
  "[OH0]": 567,
  "[=As]": 568,
  "[125IH1]": 569,
  ".[NH4+1]": 570,
  "[\\Si]": 571,
  "[Cl+1]": 572,
  "[=S@]": 573,
  "[124I]": 574,
  "[\\C@@]": 575,
  "[NH1+1]": 576,
  "[OH1]": 577,
  "[=B]": 578,
  "[Al]": 579,
  "[Ba+2]": 580,
  ".[Li]": 581,
  "[H]": 582,
  "[N@H1+1]": 583,
  "[SeH2]": 584,
  "[=Branch3]": 585,
  "[Mg]": 586,
  ".[125IH1]": 587,
  "[F-1]": 588,
  "[11C]": 589,
  "[Si-1]": 590,
  "[\\S]": 591,
  "[123IH1]": 592,
  "[He]": 593,
  ".[Cl]": 594,
  "[123Te]": 595,
  "[2H]": 596,
  "[/N]": 597,
  "[Ag+1]": 598,
  "[=NH1+1]": 599,
  ".[I-1]": 600,
  ".[O-1]": 601,
  "[123I]": 602,
  "[S@+1]": 603,
  "[Fe]": 604,
  "[S@@+1]": 605,
  "[/S@]": 606,
  "[Cl+2]": 607,
  "[75Se]": 608,
  "[LiH1]": 609,
  "[13CH2]": 610,
  "[=SeH1]": 611,
  "[/SeH1]": 612,
  "[32P]": 613,
  "[\\S+1]": 614,
  "[89Sr+2]": 615,
  "[Zn-2]": 616,
  ".[Zn+2]": 617,
  "[135I]": 618,
  "[-/Ring1]": 619,
  "[Ra]": 620,
  ".[K]": 621,
  "[N@@+1]": 622,
  "[18F]": 623,
  "[Fe-4]": 624,
  ".[C]": 625,
  "[B@@-1]": 626,
  "[P@@]": 627,
  "[C-1]": 628,
  "[MgH2]": 629,
  "[SiH2]": 630,
  "[P@+1]": 631,
  "[-\\Ring1]": 632,
  "[Cl+3]": 633,
  "[NH1-1]": 634,
  ".[Ag+1]": 635,
  "[\\O-1]": 636,
  "[/O-1]": 637,
  "[O+1]": 638,
  "[SH1]": 639,
  "[=C]": 640,
  "[=N-1]": 641,
  "[SH1-1]": 642,
  "[19F]": 643,
  ".[HH1]": 644,
  "[Ring3]": 645,
  "[Zn+2]": 646,
  "[=S-1]": 647,
  ".[85Sr+2]": 648,
  "[=13CH1]": 649,
  "[K+1]": 650,
  "[/S]": 651,
  "[=P@@]": 652,
  "[129Xe]": 653,
  "[=Fe]": 654,
  "[73Se]": 655,
  "[/Cl]": 656,
  ".[NH2+1]": 657,
  "[\\N]": 658,
  "[/Br]": 659,
  "[\\PH1]": 660,
  "[\\SeH1]": 661,
  "[Ag]": 662,
  "[Rb]": 663,
  "[Zn]": 664,
  "[\\N+1]": 665,
  "[SeH1]": 666,
  ".[Zn]": 667,
  ".[Br-1]": 668,
  "[11C@@H1]": 669,
  "[C@]": 670,
  "[BH1-1]": 671,
  "[/123I]": 672,
  "[=PH1]": 673,
  "[\\C@@H1]": 674,
  "[/P+1]": 675,
  "[/-Ring2]": 676,
  "[Te-1]": 677,
  ".[N]": 678,
  "[/C]": 679,
  ".[SiH3-1]": 680,
  "[CH2-1]": 681,
  "[OH2+1]": 682,
  "[14CH1]": 683,
  "[P]": 684,
  "[Se-1]": 685,
  "[TeH1]": 686,
  ".[H-1]": 687,
  "[=N+1]": 688,
  ".[K+1]": 689,
  "[#Branch2]": 690,
  "[=O]": 691,
  "[35S]": 692,
  "[Ring1]": 693,
  "[14C]": 694,
  "[S@]": 695,
  "[CH0]": 696,
  "[Ca+2]": 697,
  "[#O+1]": 698,
  "[B]": 699,
  "[\\Br]": 700,
  "[/P@@]": 701,
  "[14C@H1]": 702,
  "[=32P]": 703,
  "[\\C]": 704,
  "[Mg+1]": 705,
  "[11CH3]": 706,
  "[14CH3]": 707,
  "[/Se]": 708,
  "[15N]": 709,
  "[/N-1]": 710,
  "[-\\Ring2]": 711,
  "[/Si]": 712,
  "[82Rb+1]": 713,
  ".[Rb+1]": 714,
  "[Si@]": 715,
  "[BH0]": 716,
  "[Branch1]": 717,
  "[=14C]": 718,
  ".[BH0]": 719,
  "[=Se]": 720,
  "[18FH1]": 721,
  "[/B]": 722,
  "[\\C@H1]": 723,
  "[/PH1]": 724,
  "[131I-1]": 725,
  ".[C-1]": 726,
  "[As+1]": 727,
  "[Si]": 728,
  "[\\F]": 729,
  ".[Be+2]": 730,
  "[#14C]": 731,
  "[FeH2-2]": 732,
  "[211At]": 733,
  "[10B]": 734,
  "[127I]": 735,
  "[\\O]": 736,
  "[Se+1]": 737,
  "[14C@@]": 738,
  ".[Al+3]": 739,
  "[PH1]": 740,
  "[=11C]": 741,
  ".[S]": 742,
  "[Se-2]": 743,
  "[47Ca+2]": 744,
  "[NH1]": 745,
  ".[Cs+1]": 746,
  ".[Ag]": 747,
  "[#C]": 748,
  "[/-Ring1]": 749,
  "[I]": 750,
  "[K]": 751,
  ".[As]": 752,
  "[15NH1]": 753,
  ".[2H]": 754,
  "[\\123I]": 755,
  ".[SiH4]": 756,
  "[125I-1]": 757,
  "[\\11CH3]": 758,
  "[123I-1]": 759,
  "[=P@]": 760,
  "[#P]": 761,
  "[C@@H1]": 762,
  "[Cs]": 763,
  "[#S]": 764,
  "[81Kr]": 765,
  "[Cl-1]": 766,
  ".[NH1-1]": 767,
  "[/C@H1]": 768,
  "[NH3+1]": 769,
  ".[MgH2]": 770,
  ".[68Ga+3]": 771,
  "[=Se+1]": 772,
  "[C@@]": 773,
  "[=Te]": 774,
  "[/C@]": 775,
  "[=32PH1]": 776,
  "[=CH1-1]": 777,
  "[22Na+1]": 778,
  ".[Bi+3]": 779,
  "[133Xe]": 780,
  "[/F]": 781
}