{
  "<s>": 0,
  "<pad>": 1,
  "</s>": 2,
  "<unk>": 3,
  "<mask>": 4,
  "cccc([N+](=O)[O-])": 5,
  "ccc([N+](=O)[O-])": 6,
  "([N+](=O)[O-])cc": 7,
  "cc([N+](=O)[O-])": 8,
  ")[C@H](CCCNC(=N": 9,
  ")[C@H](CCCCN)NC": 10,
  "[CH][CH][CH][CH": 11,
  "C@@H](CCCNC(=N)": 12,
  "c([N+](=O)[O-])": 13,
  "](CCCNC(=N)N)NC": 14,
  "N[C@@H](CCCNC(=": 15,
  "[C@@H](CCCNC(=N": 16,
  "O)[C@H](CCCNC(=": 17,
  "@@H](CCCNC(=N)N": 18,
  "([N+](=O)[O-])c": 19,
  "COc1ccc(-c2coc3": 20,
  "(=O)[C@H](CCCNC": 21,
  "[C@@H](Cc1ccccc": 22,
  "1ccc([N+](=O)[O": 23,
  "(=O)[C@H](CCCCN": 24,
  "N+](=O)[O-])cc1": 25,
  "H](CCCNC(=N)N)": 26,
  "c[nH]c2ccccc12": 27,
  "N+](=O)[O-])cc": 28,
  ")N[C@@H](CCCNC": 29,
  "c[nH]c3ccccc23": 30,
  ")N[C@@H](CCCCN": 31,
  "@H](CCCNC(=N)N": 32,
  "([N+](=O)[O-])": 33,
  "COc1ccc(NC(=O)": 34,
  "][CH][CH][CH][": 35,
  "N[C@@H](CCCCN)": 36,
  "O=[N+]([O-])c1": 37,
  "C@H](CCCNC(=N)": 38,
  "CH][CH][CH][C]": 39,
  "COc1ccc(-c2ccc": 40,
  "[nH]c2ccccc12)": 41,
  "](CO)[C@@H](O": 42,
  "COc1ccc(-c2cc": 43,
  "ccc(S(=O)(=O)": 44,
  "C@@H](NC(=O)[": 45,
  "=[N+]([O-])c1": 46,
  "H](CO)[C@@H](": 47,
  "NC(=O)[C@@H](": 48,
  "COc1ccc(C(=O)": 49,
  "H](CCCNC(=N)N": 50,
  "N[C@@H](CCCNC": 51,
  "(=O)[C@@H](NC": 52,
  "1ccc(S(=O)(=O": 53,
  "O)[C@@H](NC(=": 54,
  "[CH][CH][CH][": 55,
  "COc1ccc2[nH]c": 56,
  "COc1ccc(/C=C/": 57,
  "[nH]c2ccccc12": 58,
  ")[C@@H](NC(=O": 59,
  "CO)[C@@H](O)[": 60,
  "1c[nH]c2ccccc": 61,
  "N+](=O)[O-])c": 62,
  "@@H](NC(=O)[C": 63,
  "](CCCNC(=N)N)": 64,
  "COc1ccc(-c2nc": 65,
  "COc1cc(C(=O)": 66,
  "(=O)[C@H](Cc": 67,
  "COc1ccc2[nH]": 68,
  "N+](=O)[O-])": 69,
  "COc1ccc(/C=C": 70,
  "CH][CH][CH][": 71,
  "COc1ccc(OC)c": 72,
  "NC(=O)[C@H](": 73,
  "COC(=O)[C@@H": 74,
  "COC(=O)c1ccc": 75,
  "CC(=O)Nc1ccc": 76,
  "COc1cc(/C=C/": 77,
  "H](O)[C@@H](": 78,
  ")[C@@H](O)[C": 79,
  "(=O)[C@H](CC": 80,
  "COc1cccc(-c2": 81,
  "@H](CO)[C@@H": 82,
  "@H](NC(=O)[C": 83,
  "CCCCCCCCCCCC": 84,
  "COc1cc2c(cc1": 85,
  ")NC(=O)[C@@H": 86,
  "CCOC(=O)c1cc": 87,
  "CC(=O)OC1CC2": 88,
  "C@H](CO)[C@@": 89,
  "Cc1ccc(C(=O)": 90,
  "COc1ccc2c(c1": 91,
  "@@H](O)[C@@H": 92,
  "NC(=O)[C@@H]": 93,
  ".[Br-].[Br-]": 94,
  "C@H](NC(=O)[": 95,
  ")[C@@H](NC(=": 96,
  "](NC(=O)[C@H": 97,
  "H](O)[C@H](": 98,
  "](NC(=O)[C@": 99,
  "[C@H](NC(=O": 100,
  "[CH][CH][CH": 101,
  ")NC(=O)[C@@": 102,
  "C@H](O)[C@@": 103,
  "@H](O)[C@@H": 104,
  "COc1ccc(-c2": 105,
  "ccc(C(F)(F)": 106,
  "O=C(Nc1ccc(": 107,
  ")N[C@@H](CC": 108,
  ")[C@H](O)[C": 109,
  ")N[C@@H](Cc": 110,
  "COC(=O)c1cc": 111,
  "C@@H](O)[C@": 112,
  "O)[C@H](Cc1": 113,
  "(=O)[C@@H](": 114,
  "COc1ccc(-n2": 115,
  "O)[C@H](O)[": 116,
  ")NC(=O)[C@H": 117,
  "COc1ccc(/C=": 118,
  "+](=O)[O-])": 119,
  "Cc1cc(C(=O)": 120,
  "COC(=O)[C@H": 121,
  "[C@H](CO)[C": 122,
  "](O)[C@H](O": 123,
  "COc1cc(/C=C": 124,
  "H](Cc1c[nH]": 125,
  "CCS(=O)(=O)": 126,
  "(S(=O)(=O)N": 127,
  "C[C@]12CC[C": 128,
  "COc1cc(OC)c": 129,
  "O=C(Nc1cccc": 130,
  "CCOC(=O)c1c": 131,
  "H](O)[C@@H]": 132,
  "N[C@@H](CC(": 133,
  "O[C@H](CO)[": 134,
  "C@@H](NC(=O": 135,
  "O)[C@H](CC(": 136,
  ")[C@@H](O)[": 137,
  "CC(=O)OC1CC": 138,
  "COc1ccccc1C": 139,
  "@@H](O)[C@H": 140,
  "C=CC(=O)Nc1": 141,
  "N[C@@H](Cc1": 142,
  "O=C(COc1ccc": 143,
  "(=O)N[C@@H": 144,
  "COc1cc(/C=": 145,
  "CC(C)(C)c1": 146,
  "Na+].[Na+]": 147,
  "(=O)[C@H](": 148,
  "C@H](C(=O)": 149,
  "Cc1c[nH]c2": 150,
  "a+].[Na+].": 151,
  "](O)[C@H](": 152,
  "O=S(=O)(c1": 153,
  "C[C@@H]1CN": 154,
  "COc1cc2c(c": 155,
  "COc1cc(OC)": 156,
  "[C@H](C(=O": 157,
  "CS(=O)(=O)": 158,
  "@@H](O)[C@": 159,
  ")[C@H](Cc1": 160,
  "O)N[C@@H](": 161,
  "NC(=O)[C@H": 162,
  "C(=O)N[C@@": 163,
  "C@H](NC(=O": 164,
  "O=C(Nc1ccc": 165,
  "S(=O)(=O)c": 166,
  "COc1ccc2nc": 167,
  "CC(C)[C@@H": 168,
  "COc1ccc(C=": 169,
  "COc1ccccc1": 170,
  "+].[Na+].[": 171,
  ")NC(=O)[C@": 172,
  "CCOC(=O)[C": 173,
  "COc1ccc(CC": 174,
  "(=O)[C@@H]": 175,
  "COc1ccc(C2": 176,
  "(F)(F)F)cc": 177,
  "COc1cc(O)c": 178,
  "C@H](O)[C@": 179,
  "CC(=O)c1c(": 180,
  "COc1cccc(-": 181,
  "N[C@H](C(=": 182,
  "(S(=O)(=O)": 183,
  "CN(C)c1ccc": 184,
  "H](O)[C@H]": 185,
  "COc1ccc([C": 186,
  "CC(C)=CCc1": 187,
  "CCOC(=O)C1": 188,
  "Cc1ccc(-c2": 189,
  "O=c1cc(-c2": 190,
  "Nc1ncnc2c1": 191,
  "COc1cccc(C": 192,
  "COc1cc(-c2": 193,
  "NC(=O)[C@@": 194,
  "CC(=O)OCC1": 195,
  "COc1ccc(CN": 196,
  "COc1ccc(N2": 197,
  "CCOC(=O)c1": 198,
  "S(=O)(=O)N": 199,
  "O=C(c1ccc(": 200,
  "OC(CO)C(O)": 201,
  "[C@H](NC(=": 202,
  "CC(=O)OC1C": 203,
  "CC(C)c1ccc": 204,
  "@H](O)[C@H": 205,
  "O)[C@H](Cc": 206,
  "FC(F)(F)c1": 207,
  "O)[C@H](CC": 208,
  "N[C@@H](CC": 209,
  "[C@@H](Cc1": 210,
  "COc1ccc(-": 211,
  "CC(=O)Oc1": 212,
  "O)[C@@H]1": 213,
  "Cc1cccc(C": 214,
  "COC(=O)CC": 215,
  "Cc1cc(=O)": 216,
  "O)N[C@H](": 217,
  "CCOc1ccc(": 218,
  "N+](=O)[O": 219,
  "(F)(F)F)c": 220,
  "N#Cc1cccc": 221,
  "[C@@H](Cc": 222,
  "COc1cccc2": 223,
  "COC(=O)C(": 224,
  "(=O)N[C@H": 225,
  ")NC(=O)[C": 226,
  "COC(=O)[C": 227,
  "O=C(c1ccc": 228,
  "COc1ccc(N": 229,
  ")[C@H](Cc": 230,
  ")C(=O)N[C": 231,
  "CC(C)(C)C": 232,
  "CNC(=O)c1": 233,
  ")C(F)(F)F": 234,
  "CC(C)[C@H": 235,
  "Cc1ccccc1": 236,
  "CC(=O)N[C": 237,
  ")N[C@@H](": 238,
  "@H](NC(=O": 239,
  "CC1(C)CCC": 240,
  "C=C1C(=O)": 241,
  ")[C@@H](O": 242,
  "ccc(Cl)cc": 243,
  "COC(=O)C1": 244,
  "COC(=O)c1": 245,
  "CC(=O)OC1": 246,
  "COc1ccc(C": 247,
  "COc1cc(C2": 248,
  "S(=O)(=O)": 249,
  "Cc1cc(C)c": 250,
  "CCOC(=O)C": 251,
  "COc1cccc(": 252,
  "Cc1cc(O)c": 253,
  "O)[C@@H](": 254,
  "F)(F)F)cc": 255,
  "COc1cc(O)": 256,
  "C(=O)N[C@": 257,
  "CC(=O)OCC": 258,
  "(=O)N[C@@": 259,
  "(C(F)(F)F": 260,
  "[Na+].[Na": 261,
  "CC(=O)Nc1": 262,
  "C(F)(F)F)": 263,
  "a+].[Na+]": 264,
  "@H](O)[C@": 265,
  "](O)[C@H]": 266,
  "(=O)(=O)c": 267,
  "O=c1[nH]c": 268,
  "COc1cc2c(": 269,
  "COc1ccc2c": 270,
  ".[Na+].[N": 271,
  ")N[C@H](C": 272,
  "CC(=O)O[C": 273,
  "O=C(COc1": 274,
  "(=O)(=O)": 275,
  "O=C1NC(=": 276,
  "C=C(C)C1": 277,
  "C[C@@H](": 278,
  ")N[C@H](": 279,
  "O=C(O)c1": 280,
  "Cc1cc(O)": 281,
  "CC(=O)NC": 282,
  "CC(=O)N1": 283,
  "Cc1cc2c(": 284,
  "[C@@H](C": 285,
  "(=O)N[C@": 286,
  "COC(=O)N": 287,
  ")[C@@H](": 288,
  "COc1cc(C": 289,
  "CCOC(=O)": 290,
  "O=C(NCc1": 291,
  "CCCC(=O)": 292,
  "CCOc1ccc": 293,
  "O=C(CCc1": 294,
  "O=C(O)CC": 295,
  "O=C(O)[C": 296,
  "N#Cc1ccc": 297,
  "CN1C(=O)": 298,
  "COC(=O)C": 299,
  "CCc1ccc(": 300,
  "COc1cccc": 301,
  ".[Na+].[": 302,
  "(C(F)(F)": 303,
  "O=C(CSc1": 304,
  "Cc1ccc(C": 305,
  "Cc1cccc(": 306,
  "Cc1cc(C)": 307,
  "(O)C(O)C": 308,
  "Cc1ccc(N": 309,
  "CC(=O)c1": 310,
  "COc1ccc(": 311,
  "C=CC(=O)": 312,
  "CCNC(=O)": 313,
  "CCC(=O)N": 314,
  "COc1c2c(": 315,
  "CC1CCC2(": 316,
  "C(=O)N[C": 317,
  "(=O)[C@H": 318,
  "O)N[C@@H": 319,
  ")[C@@H]1": 320,
  "O=C(c1cc": 321,
  "CCCCCCCC": 322,
  "COc1ccc2": 323,
  "CC(C)(C)": 324,
  "C(F)(F)F": 325,
  "NC(=O)c1": 326,
  "F)(F)F)c": 327,
  "CC(=O)OC": 328,
  ")[C@H](O": 329,
  "O)[C@H](": 330,
  "(F)(F)F)": 331,
  "CC(C)C[C": 332,
  "Cc1ccc(-": 333,
  "O=S(=O)(": 334,
  "C[C@@H]1": 335,
  "O)[C@@H]": 336,
  "COc1c(O)": 337,
  "H](O)[C@": 338,
  "CC1(C)CC": 339,
  "CC1(C)[C": 340,
  "(NC(=O)": 341,
  "CC[C@@H": 342,
  "S(=O)(=": 343,
  "C[C@H](": 344,
  "CCCc1cc": 345,
  "CCN(CC)": 346,
  "C@@H](C": 347,
  "a+].[Na": 348,
  "CCC(=O)": 349,
  "CC(=O)N": 350,
  "[C@@H](": 351,
  "(=O)N[C": 352,
  "Clc1ccc": 353,
  "CC(C)CN": 354,
  "CCCCCCC": 355,
  "CC1CCC2": 356,
  "Cc1cc(N": 357,
  "Cc1nc(N": 358,
  "CC(C)c1": 359,
  "O)N[C@@": 360,
  "C(F)(F)": 361,
  "C=C1CCC": 362,
  "2ccccc2": 363,
  "CC(C)CC": 364,
  "O=C1Nc2": 365,
  "O=C(NC1": 366,
  "C[C@H]1": 367,
  "[C@H](C": 368,
  "(F)(F)F": 369,
  ")[C@H](": 370,
  ")N[C@@H": 371,
  "F)(F)F)": 372,
  "CCOc1cc": 373,
  "Cc1ccc2": 374,
  "CCC(C)C": 375,
  "C(=O)N[": 376,
  "CC1=C(C": 377,
  "Cc1cccc": 378,
  "COc1cc2": 379,
  "Cc1cc(C": 380,
  "COC(=O)": 381,
  "O=C(NCC": 382,
  "O=C(Cc1": 383,
  ")C(=O)N": 384,
  "C=C(C)C": 385,
  "O)C(O)C": 386,
  "O=C(Nc1": 387,
  "CN1CCN(": 388,
  "O=C(N[C": 389,
  "Cc1ccc(": 390,
  "C[C@]12": 391,
  "CN(C)c1": 392,
  ")[C@@H]": 393,
  "CCc1ccc": 394,
  "(=O)[C@": 395,
  "CC1(C)C": 396,
  "O=C(CN1": 397,
  "COc1cc(": 398,
  "N[C@H](": 399,
  "COc1ccc": 400,
  "O=C1C(=": 401,
  "CC12CCC": 402,
  "O=C(O)C": 403,
  "[C@@H]2": 404,
  "CNC(=O)": 405,
  "O)N[C@H": 406,
  "O)[C@H]": 407,
  "1ccccc1": 408,
  "[C@@H]1": 409,
  "CC(C)[C": 410,
  "CC(C)C(": 411,
  "COc1c(": 412,
  ")C(=O)": 413,
  "CC(C)N": 414,
  "O)(=O)": 415,
  "CC1CCC": 416,
  "F)(F)F": 417,
  "[C@H]2": 418,
  "C=C(C)": 419,
  "[C@@H]": 420,
  "CC(C)C": 421,
  "CCc1nc": 422,
  "CC(C)=": 423,
  "CCCCCC": 424,
  "C@H](C": 425,
  "CCCCc1": 426,
  "Cc1nc2": 427,
  "Cc1nnc": 428,
  "CCc1cc": 429,
  "c1ccc(": 430,
  "O=C1C=": 431,
  "CC1OC(": 432,
  "Fc1ccc": 433,
  "(=O)c1": 434,
  "C@@H]2": 435,
  "C@H](O": 436,
  "C[C@@H": 437,
  "NC(=O)": 438,
  "CCCCN(": 439,
  "C=CCc1": 440,
  "Cc1oc2": 441,
  "O)[C@@": 442,
  "C=C1CC": 443,
  "CC[C@H": 444,
  ")N[C@@": 445,
  ")[C@H]": 446,
  "CC(C)(": 447,
  "(C)(C)": 448,
  "O=C(O)": 449,
  "(=O)[C": 450,
  "Cc1cc(": 451,
  "C[C@@]": 452,
  "N=C(N)": 453,
  "Cc1cc2": 454,
  "N#Cc1c": 455,
  "C@@H]1": 456,
  "(F)(F)": 457,
  "O=C1c2": 458,
  "(C(=O)": 459,
  "CN(Cc1": 460,
  "C(=O)N": 461,
  "CCCC[C": 462,
  "O=c1cc": 463,
  "Cc1nc(": 464,
  "O=C(NC": 465,
  "CC(=O)": 466,
  "CN(C)C": 467,
  ")C(O)C": 468,
  ")(F)F)": 469,
  "O=C(c1": 470,
  "[C@H](": 471,
  "C@@H](": 472,
  "Nc1ccc": 473,
  "COc1cc": 474,
  "O=C(CC": 475,
  "CC1(C)": 476,
  ")NC(=O": 477,
  "Cc1ccc": 478,
  "O=c1c2": 479,
  "CC1=CC": 480,
  "O=C1NC": 481,
  "Oc1ccc": 482,
  "[C@H]1": 483,
  "(=O)N[": 484,
  "Cc1c(C": 485,
  "O=C1CC": 486,
  "O=C(O": 487,
  "N[C@H": 488,
  "c1ccc": 489,
  "CCN(C": 490,
  "CC(O)": 491,
  ")(F)F": 492,
  "@@H]1": 493,
  "COCCN": 494,
  "O=C(C": 495,
  "CCCc1": 496,
  "CC1CC": 497,
  "Cn1nc": 498,
  "CN1CC": 499,
  "Cc1oc": 500,
  "(=O)N": 501,
  "O=C(N": 502,
  "@@H](": 503,
  "Cc1cn": 504,
  "C@@H]": 505,
  "C=C1C": 506,
  "O=c1c": 507,
  "CCn1c": 508,
  "COC1=": 509,
  "[C@H]": 510,
  "CC1(C": 511,
  "Cc1cc": 512,
  "CCC[C": 513,
  "Cc1c(": 514,
  "CCC(C": 515,
  "C(=O)": 516,
  "C[C@H": 517,
  "C@H](": 518,
  "F)(F)": 519,
  ")[C@@": 520,
  "[nH]c": 521,
  "C/C(=": 522,
  "C[C@]": 523,
  "C(O)C": 524,
  "C=CC1": 525,
  "CN(C)": 526,
  "Cc1nn": 527,
  "CCCN(": 528,
  "N#Cc1": 529,
  "CC1=C": 530,
  "ccccc": 531,
  "(=O)c": 532,
  "COc1c": 533,
  "Cn1cc": 534,
  "C=C[C": 535,
  "Cc1nc": 536,
  "CC(C)": 537,
  "CCOc1": 538,
  "CCCCC": 539,
  "O)[C@": 540,
  "C@H]1": 541,
  "1ccc(": 542,
  "(=O)O": 543,
  "(=O)C": 544,
  "Nc1nc": 545,
  "C=C(C": 546,
  "CCCCN": 547,
  "C/C=C": 548,
  "(=O)[": 549,
  "O)N[C": 550,
  "C@H]2": 551,
  "COC[C": 552,
  "O=C([": 553,
  "C=CCN": 554,
  "CCC1(": 555,
  ")C(O)": 556,
  "N#CC1": 557,
  "O=C1C": 558,
  "COC1C": 559,
  "COCC": 560,
  "COC1": 561,
  "O=C1": 562,
  "COc1": 563,
  "CC(C": 564,
  "(Cl)": 565,
  "CCC(": 566,
  "CN(C": 567,
  "[nH]": 568,
  ")cc1": 569,
  "OC[C": 570,
  "O)[C": 571,
  "@H]1": 572,
  "O)C(": 573,
  "CN1C": 574,
  "(C)C": 575,
  ")[C@": 576,
  "1ccc": 577,
  "C=CC": 578,
  "C=C1": 579,
  "CSc1": 580,
  "@@H]": 581,
  "CO[C": 582,
  "CC1=": 583,
  "CCCC": 584,
  "(O)C": 585,
  "O)c1": 586,
  "CCn1": 587,
  "[C@@": 588,
  "ccc(": 589,
  "CCN1": 590,
  "CC/C": 591,
  "O=C(": 592,
  "C@H]": 593,
  "O)N[": 594,
  "Cn1c": 595,
  "CCc1": 596,
  "CCC1": 597,
  "CC12": 598,
  "CN[C": 599,
  "CC1C": 600,
  "CC=C": 601,
  "C=C(": 602,
  "CCCN": 603,
  "Cc1c": 604,
  "CC1(": 605,
  "@H](": 606,
  "CNc1": 607,
  "CNCC": 608,
  "O=c1": 609,
  "Clc1": 610,
  "N#CC": 611,
  "(=O)": 612,
  ")N[C": 613,
  "C(O)": 614,
  "CC(O": 615,
  ")C(=": 616,
  "CC[C": 617,
  "CCN(": 618,
  "c1cc": 619,
  "(C(=": 620,
  "nH]c": 621,
  "(-c2": 622,
  "N[C": 623,
  "O=C": 624,
  "cc(": 625,
  "CCN": 626,
  ")[C": 627,
  "O)N": 628,
  ")c2": 629,
  "=C(": 630,
  "O)[": 631,
  "(-c": 632,
  ")CC": 633,
  "(O)": 634,
  "[C@": 635,
  "C@@": 636,
  "@H]": 637,
  "H]1": 638,
  ")C(": 639,
  "cc1": 640,
  "C)C": 641,
  "C/C": 642,
  "O=S": 643,
  "Cc1": 644,
  "CCC": 645,
  "CC=": 646,
  "NC(": 647,
  "CNC": 648,
  "C[C": 649,
  "nH]": 650,
  "C(C": 651,
  "N#C": 652,
  "CO/": 653,
  ")c(": 654,
  "ccc": 655,
  "H](": 656,
  ")cc": 657,
  "O)c": 658,
  "(C)": 659,
  ")c1": 660,
  "O)C": 661,
  "COC": 662,
  "CC(": 663,
  "O[C": 664,
  "C=C": 665,
  "CN(": 666,
  "Cl.": 667,
  "Fc1": 668,
  "CC1": 669,
  "Nc1": 670,
  "CCO": 671,
  "Cn1": 672,
  "Oc1": 673,
  "CN1": 674,
  "C[N": 675,
  "C@": 676,
  "H]": 677,
  ")[": 678,
  "OC": 679,
  "CC": 680,
  "C[": 681,
  "O=": 682,
  "CO": 683,
  "NC": 684,
  "3)": 685,
  "=C": 686,
  "@@": 687,
  "F)": 688,
  "c3": 689,
  ")N": 690,
  "](": 691,
  "(O": 692,
  "c(": 693,
  "c1": 694,
  "N#": 695,
  "CN": 696,
  "C=": 697,
  "2)": 698,
  "[C": 699,
  ")C": 700,
  "(C": 701,
  "(=": 702,
  "@H": 703,
  "c2": 704,
  "C(": 705,
  "cc": 706,
  "C)": 707,
  ")c": 708,
  "O)": 709,
  "C#": 710,
  "2c": 711,
  "@": 712,
  "]": 713,
  "4": 714,
  "F": 715,
  "H": 716,
  "=": 717,
  "2": 718,
  "1": 719,
  "(": 720,
  "3": 721,
  ")": 722,
  "N": 723,
  "[": 724,
  "C": 725,
  "CNN": 726,
  "CCCCO": 727,
  "NCCOc": 728,
  "ccncn": 729,
  "CCNCC": 730,
  "COCCCCN": 731,
  "IC": 732,
  "COCCOCCNC": 733,
  "CCCCCn": 734,
  "CCCNCC": 735,
  "COCCSc": 736,
  "(-[": 737,
  "CCCCCc": 738,
  "OCCOCC": 739,
  "CSCC": 740,
  "OCCS": 741,
  ")(=": 742,
  "Sc": 743,
  "OCCN": 744,
  "NCCCNC": 745,
  "NCCSc": 746,
  "nsc": 747,
  "OCCSCC": 748,
  "([": 749,
  ")=": 750,
  "SCC": 751,
  "35": 752,
  "NCCCc": 753,
  "-])=": 754,
  "OCCOCCS": 755,
  "CCOCCNc": 756,
  "OCCNc": 757,
  "]([": 758,
  "ccoc": 759,
  "SCCCOc": 760,
  "CCCCCCCCCCC": 761,
  "CSc": 762,
  "42": 763,
  "Cc": 764,
  "scnc": 765,
  "+][": 766,
  "ssc": 767,
  "CSCCNC": 768,
  "Br": 769,
  "NCCCS": 770,
  "ncoc": 771,
  "CSCc": 772,
  "31": 773,
  "A": 774,
  "COCCOCCN": 775,
  "OCOC": 776,
  "OP": 777,
  "I": 778,
  "cnccc": 779,
  "OCCCCN": 780,
  "21": 781,
  "ccsc": 782,
  "NCCSC": 783,
  "nncs": 784,
  "SCCNC": 785,
  "COc": 786,
  "CCCCCSc": 787,
  "CCCl": 788,
  "CCOCCSc": 789,
  "nnn": 790,
  "ncnn": 791,
  "OCc": 792,
  "OCCCc": 793,
  "+]=[": 794,
  "ClCC": 795,
  "NCCS": 796,
  "cccn": 797,
  "nn": 798,
  "CCCCCOc": 799,
  "COCCCN": 800,
  "NCCCCn": 801,
  "CCCCSC": 802,
  "NCCO": 803,
  "]/": 804,
  "CSC": 805,
  "B": 806,
  "CCCS": 807,
  "@@]([": 808,
  "CCCSCC": 809,
  "6": 810,
  "nscc": 811,
  "M": 812,
  "p": 813,
  "COCCOCC": 814,
  "NCN": 815,
  "cs": 816,
  "OCCOCCOCCOCCO": 817,
  "NCC": 818,
  "CCOCCCC": 819,
  "COCCCC": 820,
  "Nc": 821,
  "NCCC": 822,
  "nsnc": 823,
  "CCCOc": 824,
  "OCCSCc": 825,
  "K": 826,
  "ncncc": 827,
  "@]": 828,
  "COCCCNc": 829,
  "CSCCc": 830,
  "CS": 831,
  "CCCCCO": 832,
  "COCCOc": 833,
  "CCNCc": 834,
  "onc": 835,
  "e": 836,
  "CCOCCCNc": 837,
  "OCn": 838,
  "+]=": 839,
  "CCOCCCc": 840,
  "NCCNC": 841,
  "CNn": 842,
  "Nn": 843,
  "CCOCCS": 844,
  "SCCN": 845,
  "CCCCl": 846,
  "cncs": 847,
  "CONC": 848,
  "CCOCCNC": 849,
  "nnnn": 850,
  "R": 851,
  "ncc": 852,
  "CCCNc": 853,
  "-])(": 854,
  "CCCCNS": 855,
  "o": 856,
  "SCCSc": 857,
  "CSCCOc": 858,
  "9": 859,
  "NCCCNS": 860,
  "+]": 861,
  "COCCc": 862,
  "CNCCc": 863,
  "COn": 864,
  "Z": 865,
  "CCl": 866,
  "coc": 867,
  "CCCSc": 868,
  "NOC": 869,
  "NS": 870,
  ")([": 871,
  "CCBr": 872,
  "5": 873,
  "nncc": 874,
  "CI": 875,
  "OCN": 876,
  "CCCCCS": 877,
  "NCCCCOc": 878,
  "CCCSCc": 879,
  "CSCCCNC": 880,
  "COCCS": 881,
  "CSCCCCNC": 882,
  "BrCC": 883,
  "(/": 884,
  "CCNC": 885,
  "On": 886,
  "NCCc": 887,
  "+": 888,
  "#": 889,
  "\\[": 890,
  "CSCCCC": 891,
  "CCOc": 892,
  "NSC": 893,
  "SH": 894,
  "@](=": 895,
  "-][": 896,
  "COCCCOc": 897,
  "ccnc": 898,
  "CCCCSc": 899,
  "FCCC": 900,
  "CSCCN": 901,
  "cncc": 902,
  "SCCS": 903,
  "sccc": 904,
  "CSCCCN": 905,
  "Cn": 906,
  "nccs": 907,
  "CSCCC": 908,
  "OCCCO": 909,
  "SCCCO": 910,
  "COCOc": 911,
  "OCCNC": 912,
  "CCOCCOCC": 913,
  "NCCSCC": 914,
  "ccncc": 915,
  "NO": 916,
  "OCCBr": 917,
  "+])(": 918,
  "snnc": 919,
  "SCCO": 920,
  "g": 921,
  "8": 922,
  ")(": 923,
  "ON": 924,
  "ClCCCSc": 925,
  "(-": 926,
  "OCCOC": 927,
  "CCCCCCN": 928,
  "NNc": 929,
  "CSCCOC": 930,
  "NOCC": 931,
  "occc": 932,
  "nH": 933,
  "COCCCn": 934,
  "/[": 935,
  "CCSc": 936,
  "cccnc": 937,
  "NCCOCCO": 938,
  "ccs": 939,
  "ncco": 940,
  "CCOCCOC": 941,
  "ONC": 942,
  "l": 943,
  "ccno": 944,
  "SCCc": 945,
  "nncn": 946,
  "OCCSC": 947,
  "csc": 948,
  "T": 949,
  "-])/": 950,
  "CCCSC": 951,
  "COCCOC": 952,
  "nccn": 953,
  "OCC": 954,
  "r": 955,
  "ccnnc": 956,
  "][": 957,
  "SCCOC": 958,
  "CCOC": 959,
  "nccc": 960,
  "CCCCOCc": 961,
  "SCCCS": 962,
  "CCSCCOC": 963,
  "ccnn": 964,
  "NCc": 965,
  "CCCCOC": 966,
  "t": 967,
  "CCOCCCn": 968,
  "312": 969,
  "OH": 970,
  "cnnc": 971,
  "CCCCn": 972,
  "NCCNc": 973,
  "CCSCCOc": 974,
  "CCOCCOc": 975,
  "+]\\": 976,
  "OS": 977,
  "43": 978,
  "CCCF": 979,
  "45": 980,
  "34": 981,
  "13": 982,
  "COCCO": 983,
  "NCCCCN": 984,
  "nnccc": 985,
  "SCc": 986,
  "CH": 987,
  "CCCNCc": 988,
  "+](/[": 989,
  "SCn": 990,
  "](/": 991,
  "OCCF": 992,
  "cncnc": 993,
  "snc": 994,
  "OCCCC": 995,
  "OCCCn": 996,
  "Brc": 997,
  "ncn": 998,
  "csnn": 999,
  "SCCOc": 1000,
  "+](=": 1001,
  "CCOCCN": 1002,
  "+](-": 1003,
  "sccn": 1004,
  "CCCCS": 1005,
  "scc": 1006,
  "nc": 1007,
  "cncn": 1008,
  "+](/": 1009,
  "CNc": 1010,
  "CCCCCCO": 1011,
  "%": 1012,
  "BrCCC": 1013,
  "-]/": 1014,
  "NNN": 1015,
  "@@](=": 1016,
  "-])[": 1017,
  "NOCc": 1018,
  "CCCOCc": 1019,
  "ClC": 1020,
  "cnccn": 1021,
  "nnco": 1022,
  "CCCOC": 1023,
  "CSCCO": 1024,
  "NCCCn": 1025,
  "L": 1026,
  ")(/": 1027,
  "OCCCNC": 1028,
  "occ": 1029,
  "CCCNS": 1030,
  "OCCc": 1031,
  "41": 1032,
  "-[": 1033,
  "O": 1034,
  "OCCCCC": 1035,
  "CCc": 1036,
  "COCCCS": 1037,
  "CCSCC": 1038,
  "NCCCOC": 1039,
  "CCCBr": 1040,
  "CCCCNC": 1041,
  "NCCCSC": 1042,
  "COCCNS": 1043,
  "nccnc": 1044,
  "SCCn": 1045,
  "NOc": 1046,
  "@](": 1047,
  "OCCCl": 1048,
  "=[": 1049,
  "COCCCCC": 1050,
  "CON": 1051,
  "0": 1052,
  ")/[": 1053,
  "ccn": 1054,
  "CCCc": 1055,
  "a": 1056,
  "NN": 1057,
  "on": 1058,
  ")/": 1059,
  "+]/": 1060,
  "ocnc": 1061,
  "cnco": 1062,
  "CNS": 1063,
  "nnsc": 1064,
  ")=[": 1065,
  "CCSCc": 1066,
  "-]=[": 1067,
  "-": 1068,
  "CCNc": 1069,
  "CCCn": 1070,
  "conc": 1071,
  "CCOCc": 1072,
  "ssnc": 1073,
  "NCCCOCC": 1074,
  "OCCCS": 1075,
  "oc": 1076,
  "S": 1077,
  "CCONC": 1078,
  "CCCCOc": 1079,
  "CCCOCC": 1080,
  "+])": 1081,
  "CBr": 1082,
  "BrCc": 1083,
  "SCCC": 1084,
  "CCOCCn": 1085,
  "CCn": 1086,
  "NNC": 1087,
  "CCOP": 1088,
  "CCOCCCNC": 1089,
  "co": 1090,
  "NCCCSc": 1091,
  "cnsn": 1092,
  "COCCNc": 1093,
  "OCCSc": 1094,
  "COCO": 1095,
  "COS": 1096,
  "NCCCCC": 1097,
  ".": 1098,
  "CCCCCCS": 1099,
  "CSCCCNc": 1100,
  "-])([": 1101,
  ")-": 1102,
  "NCCCO": 1103,
  "b": 1104,
  "NNS": 1105,
  "CSCCn": 1106,
  "sn": 1107,
  "cnns": 1108,
  "G": 1109,
  "COCCn": 1110,
  "CCS": 1111,
  "OCCCSC": 1112,
  "CCCCCOC": 1113,
  "NCCOCC": 1114,
  "OCCNS": 1115,
  "CCOCCO": 1116,
  "cscc": 1117,
  "23": 1118,
  "cnsc": 1119,
  "(\\": 1120,
  "@@]": 1121,
  "COCCCNC": 1122,
  "OCO": 1123,
  "CCOCCC": 1124,
  "FC": 1125,
  "ccon": 1126,
  "-])=[": 1127,
  "OCCCOc": 1128,
  "OCCCSc": 1129,
  "c": 1130,
  "CCCCCNC": 1131,
  "cnnn": 1132,
  "OCCn": 1133,
  "CNCc": 1134,
  "cccs": 1135,
  "SC": 1136,
  "24": 1137,
  "OCCCN": 1138,
  "NCCCN": 1139,
  "-])": 1140,
  "n": 1141,
  "cnn": 1142,
  "OCCOc": 1143,
  "NCCCOc": 1144,
  "CCSC": 1145,
  "OCCCNc": 1146,
  "+]([": 1147,
  "NH": 1148,
  "sc": 1149,
  "ccco": 1150,
  "CSCN": 1151,
  "CCSCCC": 1152,
  "oncc": 1153,
  "OCCC": 1154,
  "CCOCCOCCOCC": 1155,
  "SCCCC": 1156,
  "CCOCC": 1157,
  "cccnn": 1158,
  "CCOCCOCc": 1159,
  "cn": 1160,
  "NOCCc": 1161,
  "CSCCSC": 1162,
  "cscn": 1163,
  "COCCSCc": 1164,
  "CCSS": 1165,
  "CCCNC": 1166,
  "P": 1167,
  "CCCCCCNC": 1168,
  "+](": 1169,
  "ncsc": 1170,
  "CCNS": 1171,
  "ncccc": 1172,
  "noc": 1173,
  "E": 1174,
  "COP": 1175,
  "12": 1176,
  "cccc": 1177,
  "123": 1178,
  "CCOCCCN": 1179,
  "7": 1180,
  ")\\": 1181,
  "@@](": 1182,
  "i": 1183,
  "ClCc": 1184,
  "54": 1185,
  "NCCNS": 1186,
  "COCc": 1187,
  "COCCC": 1188,
  "(/[": 1189,
  "X": 1190,
  "NCCN": 1191,
  "OCCCCn": 1192,
  "CSCCS": 1193,
  "no": 1194,
  "NCCCC": 1195,
  "CCCCc": 1196,
  "\\": 1197,
  "NCCSCc": 1198,
  "-]": 1199,
  "Ic": 1200,
  "nonc": 1201,
  "s": 1202,
  "COCCNCc": 1203,
  "CCCCCN": 1204,
  "SCN": 1205,
  "ncccn": 1206,
  "NCCOCc": 1207,
  "cnoc": 1208,
  "cnc": 1209,
  "SN": 1210,
  "/": 1211,
  "ccccn": 1212,
  "COCCNC": 1213,
  "COCCCOC": 1214,
  "CNCCN": 1215,
  "nnc": 1216,
  "NCCOC": 1217,
  "ncon": 1218,
  "ns": 1219,
  "Cl": 1220,
  "CNCCC": 1221,
  "OCCO": 1222,
  "NCCn": 1223,
  "nnnc": 1224,
  "OCCOCCOCCO": 1225,
  "SCCCc": 1226,
  "CCCCOCC": 1227,
  "(=[": 1228,
  "ncnc": 1229,
  "Oc": 1230,
  "@]([": 1231,
  "NCCCCl": 1232,
  "NCCCNc": 1233,
  "NCCCCCC": 1234,
  "CCCO": 1235,
  "CCCCNc": 1236,
  "32": 1237
}